{
  "url": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0236509",
  "domain": "journals.plos.org",
  "title": "Large-scale genetic admixture suggests high dispersal in an insect pest, the apple fruit moth | PLOS One",
  "abstract": "Abstract Knowledge about population genetic structure and dispersal capabilities is important for the development of targeted management strategies for agricultural pest species. The apple fruit moth, Argyresthia conjugella (Lepidoptera, Yponomeutidae), is a pre-dispersal seed predator. Larvae feed on rowanberries ( Sorbus aucuparia ), and when rowanberry seed production is low (i.e., inter-masting), the moth switches from laying eggs in rowanberries to apples ( Malus domestica ), resulting in devastating losses in apple crops. Using genetic methods, we investigated if this small moth expresses any local genetic structure, or alternatively if gene flow may be high within the Scandinavian Peninsula (~850.000 km 2 , 55 o - 69 o N). Genetic diversity was found to be high (n = 669, mean He = 0.71). For three out of ten tetranucleotide STRs, we detected heterozygote deficiency caused by null alleles, but tests showed little impact on the overall results. Genetic differentiation between the 28 sampling locations was very low (average FST = 0.016, P < 0.000). Surprisingly, we found that all individuals could be assigned to one of two non-geographic genetic clusters, and that a third, geographic cluster was found to be associated with 30% of the sampling locations, with weak but significant signals of isolation-by-distance. Conclusively, our findings suggest wind-aided dispersal and spatial synchrony of both sexes of the apple fruit moth over large areas and across very different climatic zones. We speculate that the species may recently have had two separate genetic origins caused by a genetic bottleneck after inter-masting, followed by rapid dispersal and homogenization of the gene pool across the landscape. We suggest further investigations of spatial genetic similarities and differences of the apple fruit moth at larger geographical scales, through life-stages, across inter-masting, and during attacks by the parasitoid wasp ( Microgaster politus ).",
  "content": "Knowledge about population genetic structure and dispersal capabilities is important for the development of targeted management strategies for agricultural pest species. The apple fruit moth,\nArgyresthia conjugella\n(Lepidoptera, Yponomeutidae), is a pre-dispersal seed predator. Larvae feed on rowanberries (\n), and when rowanberry seed production is low (i.e., inter-masting), the moth switches from laying eggs in rowanberries to apples (\n), resulting in devastating losses in apple crops. Using genetic methods, we investigated if this small moth expresses any local genetic structure, or alternatively if gene flow may be high within the Scandinavian Peninsula (~850.000 km\nN). Genetic diversity was found to be high (n = 669, mean He = 0.71). For three out of ten tetranucleotide STRs, we detected heterozygote deficiency caused by null alleles, but tests showed little impact on the overall results. Genetic differentiation between the 28 sampling locations was very low (average FST = 0.016, P < 0.000). Surprisingly, we found that all individuals could be assigned to one of two non-geographic genetic clusters, and that a third, geographic cluster was found to be associated with 30% of the sampling locations, with weak but significant signals of isolation-by-distance. Conclusively, our findings suggest wind-aided dispersal and spatial synchrony of both sexes of the apple fruit moth over large areas and across very different climatic zones. We speculate that the species may recently have had two separate genetic origins caused by a genetic bottleneck after inter-masting, followed by rapid dispersal and homogenization of the gene pool across the landscape. We suggest further investigations of spatial genetic similarities and differences of the apple fruit moth at larger geographical scales, through life-stages, across inter-masting, and during attacks by the parasitoid wasp (\nElameen A, Klütsch CFC, Fløystad I, Knudsen GK, Tasin M, Hagen SB, et al.  (2020) Large-scale genetic admixture suggests high dispersal in an insect pest, the apple fruit moth. PLoS ONE 15(8):\nhttps://doi.org/10.1371/journal.pone.0236509\nTzen-Yuh Chiang, National Cheng Kung University, TAIWAN\n© 2020 Elameen et al. This is an open access article distributed under the terms of the\nCreative Commons Attribution License\n, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.\nAll relevant data are within the manuscript and its Supporting Information files.\nThis work was supported by The Norwegian Institute for Bioeconomy Research (NIBIO) and the project led by professor (H.G.E.). The funders had no role in study design, data collection and analysis, decision to publish, or preparation of the manuscript.\nThe authors have declared that no competing interests exist.\nAgricultural insect pest species have considerable negative impacts on crop and fruit yields and consequently, food security. Global climate change may accelerate pest species distribution ranges and population sizes with increasing temperatures and range shifts [\n]. Hence, to counteract these effects there is a need for effective monitoring and management programs. For the development of efficient management methods, knowledge about a pest’s biology and dispersal patterns and about insect-plant interactions is needed [\n]. Furthermore, management strategies for insect pest species often assume genetically homogenous populations. However, knowledge of dispersal, genetic substructure, and hybridizations may lead to more efficient management of insect pest species [\n]. Both masting (i.e., synchronous seed production in the primary host plants) and inter-masting (i.e., years when seeding is very low) can considerably affect population dynamics in insect species [\nThe degree of population genetic differentiation in insect pest species depends on several factors. Among these, distribution and patchiness of the host plants, specialization to host species, active dispersal capabilities, and passive transport by wind dispersal may be important [\n]. It has also been shown that geography is likely an important factor for population genetic differentiation in generalist species [\n]. However, for specialist species, a narrow selection of host species may lead to host-associated genetic differentiation [\n] caused by strong selection pressures, resulting in rapidly differentiated populations. Further, insect species that display population cycles with alternating phases of rapid population growth and subsequent population crashes, show phase-specific patterns of genetic differentiation. This can, at the peak of the outbreak phase, lead to overall genetic similarity over large geographical areas [\n]. Given the complexity of these spatial-temporal genetic differentiation processes and population dynamics, individual species assessments are warranted to increase our knowledge about species-specific dispersal patterns and genetic substructuring in agricultural insect pest species.\nDetailed knowledge about insect dispersal may help understand population dynamics and develop forecasting systems to alert farmers and foresters to invasions. Outbreak dynamics often occur at large geographical scales and therefore, large-scale assessments are needed to understand population dynamics across the landscape. Both observational and genetic methods have been used to track and detect the migration and dispersal of insects. Direct observational methods like radio telemetry, harmonic radar, vertical looking radar and trapping have been used to estimate the dispersal of butterfly species [\n]. Capture-mark-recapture by labeling the wings of the monarch butterfly using hydrogen (σD) and carbon (σ\nC) showed long distance migration across the east coast of North America [\n]. Capture-mark-recapture of insects using these methods is a great challenge, due to their small size and general lack of specific return to migration sites [\n]. In addition, large-scale studies are often cost-prohibitive with traditional methods. Therefore, these observational methods are limited and cannot answer specific questions related to migratory physiology, behavior, and genetics [\n]. In contrast, genetic markers may answer questions of gene flow caused by dispersal. In several Lepidoptera species, gene flow has proven to be high over large geographic distances [\n] and between outbreaks [\n]. DNA sequencing of 101 genomes of the monarch butterfly (\n) could also detect long distance migration in addition to identifying genes and pathways associated with migratory behavior [\nThe apple fruit moth (\nArgyresthia conjugella\n, Lepidoptera, Yponomeutida, Zeller 1839) is a small species with a body length of 5–6 mm. The distribution range of the apple fruit moth includes Europe, North America, and Asia [\n]. The apple fruit moth has been detected in China and India at altitudes of 1,200 m and 2,990 m [\n], respectively. It is a specialized seed predator of rowan (\n). Females are attracted to unripe rowan berries and lay their eggs on or near the berries. The larvae bore into the fruits, where they live and forage. In late summer, the larvae drop to the ground and pupate. The pupae overwinter in the ground and the adults emerge in May-June the following year [\n]. Apple fruit moths switch from rowan to apple in inter-mast years, when rowanberry production fails or is low every 2–4 years [\n]. Thus, the apple fruit moth is a serious insect pest on apple crops in Northern Europe, and in extreme years, the species can devastate the entire apple crop [\n]. The insect locates host plants from a distance, mediated by plant volatiles [\n]. The species also exhibits nocturnal activity, and it has been suggested that adults may take advantage of wind migration [\n], but any exact knowledge of the dispersal capacity of adult and larval apple fruit moths is lacking. However, given the adult moth’s small wingspan of 6–13 mm, one could expect that active dispersal capabilities of adults are comparatively low. Larval dispersal is practically absent as the eggs are laid into the fruits of rowanberry and apple, where the larvae then develop.\nOur main objective in this study was to investigate large-scale genetic structuring of populations of the apple fruit moth as a Lepidoptera model species. Genetic studies of other Lepidoptera species with cyclic outbreaks have shown genetic differences between life stages [\n]. However, for other Lepidoptera species, genetic similarity and high gene flow have been detected both across distant geographical areas and between different years [\n]. Recently, we have shown that the apple fruit moth may have high genetic variation and local genetic structure [\n]. As an extension of these earlier studies, our aim was to investigate if the apple fruit moth expresses any broader genetic structures, or if gene flow may be high across the four very different climatic zones (from temperate to polar) on the Scandinavian Peninsula. The latter would suggest that this species can rapidly disperse despite of different climatic conditions. We believe our study may provide novel insight into the dispersal biology of the insect, as well as knowledge that could subsequently be utilized for pest management. To achieve this goal, we collected 669 individuals of the apple fruit moth over an area of approx. 850,000 km\nand subjected all individuals to genetic analysis with validated short tandem repeats (STR) genetic markers [\nMaterials and methods\nStudy area and sampling\nApple fruit moth larvae were collected from infested rowanberries in natural habitats from a total of 28 locations in Norway (17 locations), Sweden (8 locations), and Finland (3 locations) during August 2016. The study area was located on the Scandinavian Peninsula (approx. 835.498 km\n) in Northern Europe. The field work and collection of samples did not involve any endangered or protected species. The work is a part of a forecasting program of apple fruit moth attacks which, the Norwegian Institute of Bioeconomy (NIBIO) is responsible for. NIBIO, has the permission for the collection of these materials. The year 2016 was a normal seeding year for rowan trees (see\n). The study area included four different climatic zones [\n] from temperate transitional and temperate oceanic in the south to boreal and polar climate zones in the north. Field-collected rowan berries were placed on corrugated cardboard rolls, where larvae crept into the cardboard and went into pupal diapause. The infested berries and cardboard rolls were kept at ambient outdoor temperatures until collection of pupae in December 2016. Under a stereo microscope, each pupa was extracted from its cocoon, and sexed according to Ahlberg (1921) [\n]. The pupae were stored individually in Eppendorf vials at -80°C until DNA extraction.\nGeographical map of the sampling of 669 apple fruit moth larvae in 28 sampling locations (pink dots marked from A to Å, see\n) on the Scandinavian Peninsula.\nhttps://doi.org/10.1371/journal.pone.0236509.g001\nAverage (±SE) number of clusters of berries on rowan in East and West Norway 2012–2018.\nThe data were collected for the Norwegian forecasting service of apple fruit moth attacks in apple (VIPS*). Numbers are counts of rowan berry clusters on 20 reference trees at each of 21 and 38 stations in 2012, 31 and 44 stations in 2013, 30 and 44 in 2014 and 2015, 22 and 44 in 2016, 22 and 39 in 2017 and 21 and 39 in 2018, for East and West Norway, respectively. *VIPS–Open Source technology for decision support in IPM.\nhttps://www.vips-landbruk.no/applefruitmoth/\nhttps://doi.org/10.1371/journal.pone.0236509.g002\nCollection of apple fruit moths (\nin 28 different locations (latitudes and longitudes coordinates) in 2016 on the Scandinavian Peninsula.\nhttps://doi.org/10.1371/journal.pone.0236509.t001\nDNA was extracted from pupal tissues using DNeasy 96 Blood and Tissue Kits (Qiagen, Tokyo) according to the manufacturer’s instructions, and the only modification was the elution of DNA in 150μl instead of 50–100μl elution buffer.\nFrom our previous work on apple fruit moths [\n], we selected 10 out of 19 tetranucleotide STRs for the present study. We based our selection of STRs on a combination of high number of alleles, optimal peak height, and clear interpretation (results not shown). First, we carried out the PCR amplifications and the fragment analysis for 19 tetranucleotide STRs in four different multiplex panels as described previously in [\n], and then we selected 10 STRs for further analysis (\n). Briefly, genotyping optimization was carried out in two steps: (i) single PCRs were initially performed on seven apple fruit moth individuals for each primer pair in 10μl reactions. Each PCR reaction contained 1x PCR Gold buffer (ABI), 200 μM dNTP (Eurogentec), 1.5 mM MgCl\n(ABI), 0.5 μM of each primer (Life technologies), 1 U Amplitaq Gold DNA polymerase (ABI), 1x BSA (NEB), and 1 μl template DNA (0.1 to 2.0 ng). PCRs were performed on a 2720 Thermal cycler and the conditions for the PCR were 10 min at 95°C, 26 cycles of 30 s at 94°C, 30 s at 58°C, 1 min 72°C, and final extension for 45 min at 72°C. (ii) multiplex PCRs were developed by testing different primer combinations until a set of four markers amplified successfully with clear chromatograms and without artificial alleles/spikes/primer dimers. The PCR forward primer for each locus was labeled with one of four different fluorescent labels (6-FAM, NED, PET, and VIC) in such a manner that no two markers with the same fluorescent dye had overlapping allele size ranges. The primer concentrations were optimized to result in equal peak heights (RFU) for all markers within a multiplex panel, and the number of cycles for all PCR reactions was optimized to achieve optimal peak height of alleles (between 8,000–24, 000 RFU). For the final analysis, the STR markers were split into three multiplexes. The PCR reactions were carried out in 10 μl reaction volumes containing: 5 μl 2x multiplex PCR master mix (Qiagen Multiplex kit), 0.05 μg/μl BSA (NEB), and adjusted primer set concentrations. PCR conditions for multiplexes were carried out as: 10 min at 95°C, 24 cycles of 30 s at 94°C, 30 s at 58°C, 1 min 72°C, and final extension for 45 min at 72°C. Separation of fluorescently-labeled PCR products was carried out on an Applied Biosystems 3730xl Genetic Analyzer (Applied Biosystems, UK) and GeneMapper 5.0 (Applied Biosystems, USA) was employed to determine allele sizes. Negative and positive controls were included on all 96-wells plates. In addition, we performed a separate re-run with eight different individuals with all multiplex reactions to ensure reproducibility. We excluded individuals with low amount or bad quality of DNA, or individuals with results that showed four or more missing loci, from the study. Concerning potential genotyping errors, we randomly selected three specimens per population and re-amplified those with the 10 STR marker set. Then, we compared the retrieved genotypic profiles with the results of the first amplification round. All genotypic profiles were identical, indicating that STR markers could be reliably amplified and scored. In addition, we were able to rule out any mix-ups of plates that might have led to erroneous statistical results. Based on these results, we concluded that genotyping and scoring errors or other lab-related errors can be excluded as potential causes for obtained genetic patterns in this study. Finally, we also tested the difference in power to detect genetic differentiation and structure with the smaller dataset (n = 64) from the previous study [\n], applying two STRUCTURE runs with the 10 selected STRs as well as the total set of 19 STR markers. This test indicated only a minor loss of power for the 10 STRs relative to whole set of 19 STRs (results not shown).\nGenetic diversity per locus, averaged across populations, of the apple fruit moth (\n) on the Scandinavian Peninsula in 2016 (n = 669).\nhttps://doi.org/10.1371/journal.pone.0236509.t002\nTests for null alleles, scoring errors, and large allele dropouts were conducted with MICRO-CHECKER 2.2.3 [\n]. We tested for deviations from Hardy–Weinberg equilibrium (HWE) and linkage equilibrium using GENEPOP 4.0 [\n]. The same program was utilized to calculate the number of alleles, allele frequencies, expected and observed heterozygosity, as well as the inbreeding coefficient (F\n) for each STR locus and averages across all STRs per sampling location. Run parameters included the Markov chain method with 10,000 dememorization steps, 5,000 batches, and 10,000 iterations to estimate P-values. Moreover, we calculated Nei’s genetic diversity [\n] using Popgene version 1.32 [\n]. In addition, we calculated the index of association (IA) to test for random recombination between pairs of all the loci for sample locations using the software LIAN [\nWe tested for genetic structure using Bayesian assignment analysis with STRUCTURE 2.3.4 [\n], which was run with the admixture model with correlated allele frequencies [\n]. K = 1–10 was tested with 40 replicates each in two sets of analyses: one employing the LOCPRIOR option and one without. The LOCPRIOR option assists detection of weak population genetic structure without overestimating genetic structuring [\nSince uneven population sizes can lead to false inferences about the number of genetic clusters in Bayesian assignment tests [\n], the software STRUCTURE SELECTOR [\n] was used to determine the most likely number of genetic clusters (K) in the data set. Finally, averaging of assignment scores across runs and preparation of bar plots was conducted in CLUMPAK [\n]. In addition, we followed the method developed by Evanno et al. (2005) [\n], and plots of ΔKs [\n] were made with STRUCTURE SELECTOR [\n]. To test for the effect of null alleles, we ran both sets of analyses with 10 (i.e., including loci showing null alleles) and seven loci (i.e., excluding loci showing null alleles). In addition, a Discriminant Analysis of Principal Components (DAPC) was performed with the Adegenet package 2.1.1 [\n] in R version 3.5.1 [\n]. DAPC does not make any assumptions about Hardy–Weinberg or linkage equilibrium and has shown to outperform STRUCTURE in some instances, depending on the underlying gene flow pattern [\n]. The cross‐validation function with 100 replicates was applied to determine the optimal number of principal components to be retained. In the apple fruit moth, adult females have a larger wingspan (7–13 mm) than males (6–10 mm). This difference in wingspan may cause a difference in dispersal rates and distances. Hence, we tested for differences in genetic differentiation between the two sexes using a Principal Coordinate Analysis (PCO). PCO analyses based on location, sex, and potential genetic clusters were performed using the NTSYS-pc software [\nWe performed a hierarchical Analysis of Molecular Variance (AMOVA) analysis [\n] to estimate the partitioning of genetic variation among and within all sampling locations as well as some neighbouring sampling sites pooled (= geographical regions), using the Arlequin software, version 2.000 [\n]. Similarly, genetic distances between sampling locations were estimated as pair-wise F\nvalues and significance of pairwise F\nvalues was tested with 9,999 permutations with the same software.\nIn addition, two genetic differentiation estimators were calculated, G\n] to provide alternative measures of population genetic differentiation [\nfunction in R to correct for multiple testing of all pairwise genetic differentiation values with the Benjamini-Hochberg correction [\nGene flow was estimated assuming Nm = (1/F\n] was used to correlate the matrix of genetic distances with the matrix of spatial distances in kilometres. The genetic distance matrix was constructed using the genetic distance in arbitrary units between each possible pair of the 669 individuals. The significance of Mantel’s test value was tested with 10,000 permutations; these analyses were performed using GENALEX 6.5 [\nSince null alleles were found to be present at three loci (\n), the analyses were run a second time excluding those loci to assess the potential effects of null alleles on population genetic analyses. In addition, population genetic differentiation estimates were corrected with FreeNA (corrected F\nvalues using the ENA method; Chapuis and Estoup (2007) [\nWe estimated relatedness within and among sampling sites using the R package RELATED v.1.0 [\n]. First, the performance of four different relatedness estimators was tested using the\nfunction implemented in RELATED. Subsequently, the best relatedness estimator with the highest correlation coefficient (R) was chosen to compare the observed relatedness values for each sampling site against deviations from random mating expectations, using 1,000 permutations, to determine whether individuals within sampling sites were more closely related than expected.\nWe utilized the software INEST 2.2 [\n] to test whether bottlenecks were present in the data set under an infinite allele model (IAM), stepwise mutation model (SMM), and a two-phase model (TPM). The software was run with default settings because these followed recommendations by Peery et al. (2012) [\n]. Both implemented statistical tests, the test for excess of heterozygosity and the deficiency in M-ratio, assessed with Z-tests and the Wilcoxon signed-rank tests, were used to assess significance. The software was also used to calculate unbiased inbreeding coefficients (FISC) corrected for the presence of null alleles. These analyses were conducted using the Bayesian individual inbreeding model (IIM) with 250,000 MCMC iterations, a burn-in of 20,000, and the thinning parameter was set to 200 to retain at least 1,000 updates.\nWe collected apple fruit moth larvae from rowan trees from 28 sampling locations on the Scandinavian Peninsula during 2016. This was a normal seeding year for rowan trees, with higher seeding values than the two previous years (see\n). The detailed genetic analysis of ten selected STR markers for 669 apple fruit moth larvae from the same year showed that the number of alleles/STR locus was between 4 and 26 with a mean of 12.5 (\n). The individual allele frequencies for each locus are shown in\n. The observed and expected heterozygosity ranged from 0.379 to 0.868 and 0.423 to 0.926, respectively, for the 10 different STRs. The mean expected heterozygosity was He = 0.712, Nei’s genetic diversity index ranged from 0.422 to 0.925, and estimated F\nvalues for the STR loci Arg3484, Arg5649, and Arg3813 were high, indicating inbreeding or the presence of null alleles. However, the overall results indicated high genetic diversity for the apple fruit moth on the Scandinavian Peninsula. Concerning linkage disequilibrium, 90 out of 1,162 pairwise comparisons were significant at the 0.05 level, but none of these remained significant after Bonferroni correction for multiple testing. No signs of scoring errors due to stutter bands and large allele dropouts could be found; however, three loci (i.e., Arg3484, Arg5649, and Arg3813) showed consistent and significant signs of null alleles (\n). Frequency of null alleles ranged from 0.000–0.415 at Arg3484, 0.000–0.585 at Arg5649, and 0.000–0.271 at Arg3813, indicating that null alleles were prevalent at these three loci.\nFor 26 out of 28 sampling locations, we determined the mean number of alleles, expected and observed heterozygosity, FIS, FST, and index of association averaged across loci (\n). Locations L and V had only 3 and 4 individuals, respectively, and were not included in this analysis. The mean index value of association was found to be very low (IA = 0.013), which may indicate random mating.\nGenetic summary statistics for 26 different sampling locations, averaged across STR loci, for apple fruit moths (\n) on the Scandinavian Peninsula in 2016.\nAll 26 populations showed deviations from Hardy-Weinberg expectations.\nhttps://doi.org/10.1371/journal.pone.0236509.t003\nGenerally, genetic differentiation between sampling locations was found to be weak for most pairwise F\ncomparisons using both 10 and seven STRs (\nTables, respectively). F\n-values ranged from -0.001 to 0.087, with the highest differentiation value between sampling location K and X, while populations A and B were the least differentiated (\nvalue was low, but significant (= 0.016, P < 0.000). In contrast, eight of the 28 sampling sites were significantly differentiated from most other populations, namely, locations H, J, K, M, O, T, X, and Z when including ten STR loci in the analysis (\n). This was largely in agreement with the results of the DAPC analysis (\n), which showed genetic differentiation for at least five of the same sampling sites (i.e., H, K, O, T, and X). To test if the presence of null alleles could possibly influence the result, we excluded the potential null alleles by only using the seven STRs with the lowest F\nand repeated the analysis. The result showed that, when using seven instead of ten STRs, fewer sampling sites (i.e., K, O, X, and Z) were genetically differentiated from most other locations, which was again partially confirmed by the DAPC (\n). Correction of population genetic differentiation values using FreeNA resulted in only slightly different values. The global F\nvalues changed only a little from 0.011073 to 0.011083 using the ENA method. Genetic differentiation for the 10 and the seven STRs, estimated using G\nand Jost’s D, supported the results above (\nTables, respectively).\nDiscriminant analysis of principal components (DAPC) of 669 apple fruit moths (\n) on the Scandinavian Peninsula using 10 STRs (A) and seven STRs (B). Letters correspond to sampling locations given in\n. DA eigenvalues and PCA eigenvalues are given in boxes to the right and left in relative magnitude.\nhttps://doi.org/10.1371/journal.pone.0236509.g003\nBayesian clustering analysis with the STRUCTURE software assigned the 669 apple fruit moths to two different non-geographical clusters, when running the analysis without the LOCPRIOR option and 10 loci (\n). When using the LOCPRIOR function, K = 3 was the most likely number of genetic clusters (\n) with DeltaK plots indicating 2–3 clusters, respectively (\n). The bar plots using LOCPRIOR (\n) showed that in sampling sites H, J, K, O, T, and X either assignments were high on average to one of the main clusters and/or that partial ancestry from a third cluster was present. These locations were largely found to be significantly genetically differentiated from other sampling sites in the DAPC and population genetic differentiation estimates (see above,\n). Taken together, these results suggested that population genetic differentiation was low in this species across the study area. However, specific sampling sites were consistently identified as genetically differentiated. Again, we repeated the analysis with only seven STRs (excluding the three STRs with possible null alleles). This analysis also identified 2–3 genetic clusters (\n) although, as expected, some power was lost in the assignment, and fewer sampling sites came out as genetically differentiated.\nPopulation genetic structure for the apple fruit moth (\n) on the Scandinavian Peninsula in 2016 (n = 669) using 10 STR loci.\nBayesian assignment was performed using the program STRUCTURE with bar plots for K = 2 to K = 3, without (A) and with (B) LOCPRIOR.\nhttps://doi.org/10.1371/journal.pone.0236509.g004\nPrincipal coordinate analyses (PCO) showed no genetic differences between males and females (\n). Analysis of molecular variance (AMOVA) indicated that most of the total genetic variability in the apple fruit moth (98.38%) was within sampling locations, while the genetic variability among sampling locations and major geographic regions was low (1.35% and 0.27%, respectively; see\nHierarchical analysis of molecular variance (AMOVA) for the apple fruit moth (\nsampling locations on the Scandinavian Peninsula.\nGeographical regions (N = 15) consisted of pooled adjacent sampling sites. The average F\nvalue was significant and found to be low (= 0.016, P < 0.000).\nhttps://doi.org/10.1371/journal.pone.0236509.t004\nEstimated gene flow among the populations was high (Nm = 15.1). Mantel’s test value was very low, but significant (r = 0.001, P < 0.000), indicating largely a lack of correlation between genetic and geographic distances (\nMantel test (r = 0.001) showed significant but low correlation between genetic and geographic distances for apple fruit moths (\n) (n = 669) on the Scandinavian Peninsula in 2016.\nhttps://doi.org/10.1371/journal.pone.0236509.g005\nIsolation-by-distance tests revealed that there was a weak but significantly increasing genetic differentiation with increasing geographic distance (\n] relatedness estimator (rw) had the highest correlation coefficient (r = 0.826) and was therefore the best fit for our data. Relatedness values were very low within and across sampling sites (overall r = -0.005,\n) and therefore consistent with random mating. However, there was a significant deviation from relatedness values expected under random mating (P = 0.011), likely caused by lower than expected relatedness values within sampling sites. Therefore, the existence of local structure cannot be explained by the collection of closely related individuals, and the impact of related individuals on other statistical analyses was considered negligible. Corrected inbreeding coefficients (FISC,\n) were low within each of the sampling sites. They were also much lower than uncorrected inbreeding coefficients (FIS,\n), suggesting that null alleles were the main cause for the elevated FIS values.\nRegarding bottlenecks, no consistently significant results were found for any of the sampling sites tested, suggesting that recent demographic bottlenecks were absent.\nIn this study, we found that the apple fruit moth showed high genetic diversity and overwhelming genetic admixture within one study year for both sexes, over large areas, and across different climatic zones. We found two major non-geographic genetic clusters in contrast to geographic substructure in 20–30% of the specific sampling locations on the Scandinavian Peninsula. We also detected null alleles among the STRs, which may affect the results. Consequently, we included tests in the study to avoid bias in the population genetic analyses.\nNull alleles in STR markers appear to be common in taxa with high effective population sizes, such as lepidopteran species [\n]. Null alleles are thought to be associated with transposable elements or unequal crossing over [\n]. Therefore, flanking regions of STR markers can occur several times throughout the genome, thus leading to scoring issues due to multiple banding patterns and non-allelic size variations [\n]. The presence of null alleles can considerably affect the results of population genetic analyses [\n]. These effects include inflating genetic differentiation between sampling sites (e.g., FST) and potentially leading to false, non-existing, identification of population genetic structure in Bayesian assignment tests [\n]. Concerning isolation-by-distance, a simulation study [\n] found that null alleles reduce the power of detection of this pattern. Finally, inbreeding coefficients (i.e., FIS) are usually artificially inflated as well because of the increased presence of homozygotes, leading to erroneous interpretations of this parameter [\n]. Different strategies have been proposed to deal with null alleles, ranging from eliminating the loci that show evidence of null allele presence to correction procedures of null allele frequencies. Here, we ran STRUCTURE including and excluding the above-mentioned three loci to evaluate the impact of null alleles on population genetic analyses. In both cases, the most likely number of genetic clusters detected was K = 2–3 (depending on whether the LOCPRIOR option was used), suggesting that these genetic clusters are not generated by the presence of null alleles. Further, F\nwas estimated using the correction method implemented in FREENA [\n], as well as by including and excluding the three loci in GENALEX 6.5 [\n], resulting in very similar results for genetic differentiation estimates. Finally, tests for isolation-by-distance using different genetic distance estimators as recommended by [\n], FREENA corrected genetic distances, and the reduced data set with seven loci retrieved consistently significant isolation-by-distance patterns. This is in agreement with findings by others [\n] in that the strongest null allele effects can be found when genetic differentiation is strong. Hence, given the generally weak population genetic differentiation found here, the changes in genetic differentiation values and the impact on isolation-by-distance patterns were small. Therefore, we conclude that the effect of null alleles was negligible in the current study.\nReducing the number of STRs from 19 to 10 in this study led only to limited loss of genetic differentiation detection power in a test based on a smaller dataset and a smaller geographical area. The more than ten times larger dataset and the high number of alleles in the present study may additionally reduce this loss in power to detect genetic structure. Thus, we conclude that the alternative use of all 19 STRs [\n] may not represent a cost-benefit for the analysis and would only lead to a minimal increase in the sensitivity of the genetic structure analysis. The lower cost and time-saving strategy in our study included selecting the 10 STRs with the best performance and highest genetic variation. Thus, similar strategies may also be important for other studies investigating insect species with high numbers of individuals.\nThe substructure that we observed for six (i.e., sampling sites HJKOTX, see\n) of the 28 sampling locations has no obvious explanation, but we note that sampling sites K and X are located farthest to the south and sampling sites J and O are situated farthest to the north. We have excluded the possibility that recent bottlenecks and closely related individuals contributed to local population genetic structure. Thus, we speculate that geographical isolation combined with some unknown environmental factors have caused the minor substructure observed in the STRUCTURE analysis. Alternatively, the low number of individuals clustering in two small genetic clusters could be because some individuals can overwinter as pupae in the soil under rowan trees and the species seems well adapted to the Scandinavian winter temperatures [\n]. In the spring, adult female emerging from overwintering pupae release a sex-pheromone to attract conspecific males. After mating, oviposition occurs on green rowan berries. Thus, the few individuals assigned to the two small genetic clusters at K = 3 may represent genetically differentiated individuals from a previous generation.\nThe lack of genetic differentiation across large areas indicated a high migration rate for the apple fruit moth. A high migration rate has been found to be rather common in Lepidoptera species, e.g.\nSpodoptera frugiperda\n]. Spring-migrating Lepidoptera species, like the apple fruit moth, are often wind-aided and have long distance dispersal compared to autumn migrating species [\n]. We speculate that wind migration may enable the apple fruit moth to passively disperse over longer distances than would be possible by active flight alone. Previously, wind-aided long-distance migration has been suggested for\n]. The migration distance of\nwas reported to be over 2,000 km at an altitude above 500 meters from Finland to UK [\n]. In northern Europe,\nachieved long-distance migration (up to 100 km/ night) by favoring directed winds and selecting specific flight altitudes [\n]. Based on our results, we suggest that the apple fruit moth also has similar capabilities for fast and long-distance migration. The mechanisms for such long-distance migration and gene flow are not well known. Apple fruit moth population growth has been shown to be variable across years but synchronized with rowanberry production cycles and a parasitoid wasp (\n]. This opens the possibility that the availability and spreading of rowan trees grown at variable locations and altitudes combined with repeated parasitoid attacks may influence the yearly dispersal of the apple fruit moth. In our genetic analysis, we find a general lack of population geographic structure, low association among most sampling populations, and high gene flow. Such characteristics are comparable to and may resemble the genetic similarity and admixture seen in cyclic forest Lepidoptera species [\nIn a study in Norway in 2011 using AFLP data, we found two genetic clusters separated by a mountain plateau [\n], while spatial genetic differentiation was found to be much lower in 2015 using STRs [\n]. This generally contradicts the findings of the current study as individuals from both of the two major genetic groups are randomly spread all over the much larger geographic area across the entire Scandinavian Peninsula. One hypothesis is that rowan inter-masting [\n] could cause a severe reduction in population size. The result may be local genetic bottlenecks, leading to strong genetic drift effects and the establishment of geographically differentiated populations. However, this pattern may not be stable because the population growth in masting years, in which rowan berry production is high across the landscape, may facilitate high dispersal and genetic admixture all over the study area; thereby breaking down the temporal signal of spatial genetic differentiation. In this case, the weakly differentiated populations found here may be remnants of previously stronger differentiated populations. Two main, non-mutually exclusive, hypotheses have been proposed to explain spatial synchrony of insect species with cyclic population dynamics. The epicenter hypothesis states that density-dependent dispersal from one main source population leads to the gradual homogenization of the gene pool. The second hypothesis, also called the Moran effect, states that local populations undergo population growth and dispersal is roughly equal between populations. This lead to overall homogenization of the gene pool over time as the growth phase progresses [\n]. Generally, genetic diversity at panmixia is expected to be higher if the Moran effect is the main driver of spatial-temporal patterns. This is because genetic diversity originates from several source populations, whereas under the epicenter hypothesis, genetic diversity should generally be lower because one main source population is involved, and edge populations should display particularly low genetic diversity because of repeated bottlenecks along the way. In the current study, high genetic diversity was found across the study area with low genetic differentiation patterns, signs of recent bottlenecks were absent, and relatedness was low within sites. Coupled with the results of a previous study where strong spatial genetic differentiation was found at comparatively small geographical scales [\n], this suggests a strong Moran effect. However, a significant isolation-by-distance pattern is expected under the epicenter hypothesis because genetic variation will change gradually with distance from the source population. We found a weak but significant isolation-by-distance pattern and high migration rates. Isolation-by-distance tests have been shown to result in weak patterns in the presence of populations that are located at the edges of the metapopulation [\n]. This is because these populations will receive different dispersers from more central populations. This leads to higher variance between subpopulations, while all of them are related to central populations to some extent. In the present study, a high number of coastal populations in Scandinavia are likely situated at the edge of the distribution range (i.e., there are no populations further west or north of the current sampling locations). Therefore, this phenomenon might have contributed to the weak isolation-by-distance pattern found.\nTherefore, we are currently unable to fully distinguish between these two hypotheses and cannot exclude the possibility that a mixed effect is present in the apple fruit moth. Hence, future studies with a temporal sampling design are needed to further corroborate these initial findings. Our results further suggest that 2012 (i.e., the collection year of the 2016 study [\n]) was a period with small population sizes and therefore, in a crash phase, whereas 2016 (i.e., the collection year of the current study) appears to have been (close to) the peak phase of the outbreak. Indeed, this is suggested by the number of rowan berries found in West and East Norway over time (\n). In 2012, there were few rowan berries, while in 2016, rowan berries were far more abundant. This indicates that apple fruit moth populations were in a growth phase in 2016, suggesting that an interval of maximum four years is necessary to complete an outbreak cycle. This is consistent with previous results showing that rowanberry masting occurred every 2–4 years [\n]. As mentioned above, additional factors like passive wind dispersal may contribute to the quick breakdown of spatial differentiation patterns in outbreak phases [\nPopulation structure may also be influenced on a more global scale, as for the relationship between metapopulation dynamics [\n] and several local populations. High gene flow, migratory flight activity [\n], and genetic hybridization [\n] has been shown for other Lepidoptera pest species to occur on a global scale, for example, for the cotton bollworm (\n). Thus, we suggest to further investigate if these spatial genetic similarities and differences of the apple fruit moth persist on larger geographical scales, through life-stages, across the dynamic fluctuations of low rowanberry production (inter-masting), and during attacks by the parasitoid wasp (\nSupporting information\nAllele frequencies for 10 STR markers from the apple fruit moth (\n) on the Scandinavian Peninsula in 2016 (n = 669).\nhttps://doi.org/10.1371/journal.pone.0236509.s001\nEstimated pair-wise genetic distances (FST) values between 26 sampling locations for the apple fruit moth (\n) on the Scandinavian Peninsula.\nThe analysis is based on 10 STR loci using the Arlequin software version 2.0 [\nvalues below the diagonal. Probability, P(rand > = data) based on 9,999 permutations is shown above diagonal. Bold values are significant after Benjamini-Hochberg [\n] correction for multiple tests and values marked by * are significant at the p < 0.05 level.\nhttps://doi.org/10.1371/journal.pone.0236509.s002\nEstimated pair-wise genetic distances (FST) values between sampling 26 locations for the apple fruit moth (\n) on the Scandinavian Peninsula, based on analysis of seven STRs loci, excluding the loci showing null alleles, using Arlequin software version 2.0 [\nvalues below the diagonal. Probability, P(rand > = data) based on 9,999 permutations is shown above diagonal. Bold values are significant after Benjamini-Hochberg [\n] correction for multiple tests and values marked by * are significant at the p < 0.05 level.\nhttps://doi.org/10.1371/journal.pone.0236509.s003\nPairwise population matrix of GST (Nei & Chesser, 1983) [\nvalues below the diagonal. Probability, P(rand > = data) based on 9,999 permutations is shown above diagonal. Bold values are significant after Benjamini-Hochberg [\n] correction for multiple tests and values marked by * are significant at the p < 0.05 level.\nhttps://doi.org/10.1371/journal.pone.0236509.s004\nPairwise population matrix of GST (Nei & Chesser, 1983) [\n] based on seven loci.\nvalues below the diagonal. Probability, P(rand > = data) based on 9,999 permutations is shown above diagonal. Bold values are significant after Benjamini-Hochberg [\n] correction for multiple tests and values marked by * are significant at the p < 0.05 level.\nhttps://doi.org/10.1371/journal.pone.0236509.s005\nPairwise population matrix of DEST (Jost, 2008) [\nvalues below the diagonal. Probability, P(rand > = data) based on 9,999 permutations is shown above diagonal. Bold values are significant after Benjamini-Hochberg [\n] correction for multiple tests and values marked by * are significant at the p < 0.05 level.\nhttps://doi.org/10.1371/journal.pone.0236509.s006\nPairwise population matrix of DEST (Jost, 2008) [\n] based on seven loci.\nvalues below the diagonal. Probability, P(rand > = data) based on 9,999 permutations is shown above diagonal. Bold values are significant after Benjamini-Hochberg [\n] correction for multiple tests and values marked by *are significant at the p < 0.05 level.\nhttps://doi.org/10.1371/journal.pone.0236509.s007\nIsolation by distance tests with different genetic distances and different transformations for geographic distance based on 10 STR loci analyzed for 669 apple fruit moth larvae on the Scandinavian Peninsula.\n; genetic distances were not transformed into linear genetic distances,\n: genetic distances were transformed. In parentheses: results were\nfor null alleles (generated by the FreeNA method, Chapuis et al. (2007) [\ndesignates the chord distance that was used as this genetic distance metric has been suggested to perform better in a range of circumstances in isolation by distance tests when null alleles are present (Séré et al. 2017) [\n]. For geographic distance, two different transformations (i.e., linear and log-transformed) were tested. Finally, the P value for each test is given. a = intercept of x-axis, b = intercept of y-axis.\nhttps://doi.org/10.1371/journal.pone.0236509.s008\nEstimation of the most likely number of genetic clusters among 669 individuals of apple fruit moth on the Scandinavian Peninsula using STRUCTURE SELECTOR results for four recently introduced estimators by Puechmaille (2016) [\n]: The median of means (MedMeaK), maximum of means (MaxMeaK), median of medians (MedMedK), and maximum of medians (MaxMedK).\nA. Results for runs with 10 loci and no LOCPRIOR; B. Results for runs with 10 loci and with LOCPRIOR option.\nhttps://doi.org/10.1371/journal.pone.0236509.s009\nEstimation of the most likely number of genetic clusters among 669 individuals of apple fruit moth on the Scandinavian Peninsula using STRUCTURE SELECTOR results for four recently introduced estimators by Puechmaille (2016) [\n]: The median of means (MedMeaK), maximum of means (MaxMeaK), median of medians (MedMedK), and maximum of medians (MaxMedK).\nA. Results for runs with seven loci and no LOCPRIOR; B. Results for runs with 7 loci and with LOCPRIOR option.\nhttps://doi.org/10.1371/journal.pone.0236509.s010\nDeltaK plots generated by STRUCTURE SELECTOR.\nA. 10 loci without LOCPRIOR, B. 10 loci with LOCPRIOR, C. Seven loci without LOCRPRIOR, and D. Seven loci with LOCPRIOR.\nhttps://doi.org/10.1371/journal.pone.0236509.s011\nPopulation genetic structure for the apple fruit moth (\n) on the Scandinavian Peninsula in 2016 (n = 669) using seven STR loci.\nBayesian assignment was performed using the program STRUCTURE with bar plots for K = 2 to K = 3, without (A) and with (B) LOCPRIOR.\nhttps://doi.org/10.1371/journal.pone.0236509.s012\nPrincipal coordinate analysis (PCO) score plot of apple fruit moths (\n) (n = 669) using 125 alleles from 10 STR loci where males and females are marked in blue and red, respectively.\nhttps://doi.org/10.1371/journal.pone.0236509.s013\nThe Norwegian Institute for Bioeconomy Research (NIBIO) has financed this work. The authors would like to thank Dr. Arne Hermansen for his interest and support of the project. The authors would also like to thank Dr. Venche Talgø for collecting the Finnish apple fruit moth populations.",
  "authors": [],
  "journal": "PLOS ONE",
  "date": "",
  "keywords": [
    "Moths and butterflies",
    "Apples",
    "Fruits",
    "Population genetics",
    "Genetic loci",
    "Genetics",
    "Crop genetics",
    "Phylogeography"
  ]
}