{
  "url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7927104/",
  "domain": "www.ncbi.nlm.nih.gov",
  "title": "Microplastics in the Marine Environment: Sources, Fates, Impacts and Microbial Degradation",
  "abstract": "Abstract The serious global microplastic pollution has attracted public concern in recent years. Microplastics are widely distributed in various environments and their pollution is already ubiquitous in the ocean system, which contributes to exponential concern in the past decade and different research areas. Due to their tiny size coupled with the various microbial communities in aquatic habitats capable of accumulating organic pollutants, abundant literature is available for assessing the negative impact of MPs on the physiology of marine organisms and eventually on the human health. This study summarizes the current literature on MPs in the marine environment to obtain a better knowledge about MP contamination. This review contains three sections: (1) sources and fates of MPs in the marine environment, (2) impacts of MPs on marine organisms, and (3) bacteria for the degradation of marine MPs. Some measures and efforts must be taken to solve the environmental problems caused by microplastics. The knowledge in this review will provide background information for marine microplastics studies and management strategies in future. Keywords: source, fate, bacterial degradation, marine environment, microplastics",
  "content": ". 2021 Feb 22;9(2):41. doi:\n10.3390/toxics9020041\nMicroplastics in the Marine Environment: Sources, Fates, Impacts and Microbial Degradation\nJoint Laboratory of Guangdong Province and Hong Kong Region on Marine Bioresource Conservation and Exploitation, College of Marine Sciences, South China Agricultural University, Guangzhou 510642, China; hry@scau.edu.cn (H.Y.); glchen@scau.edu.cn (G.C.)\nGuangdong Laboratory for Lingnan Modern Agriculture, South China Agricultural University, Guangzhou 510642, China\nJoint Laboratory of Guangdong Province and Hong Kong Region on Marine Bioresource Conservation and Exploitation, College of Marine Sciences, South China Agricultural University, Guangzhou 510642, China; hry@scau.edu.cn (H.Y.); glchen@scau.edu.cn (G.C.)\nGuangdong Laboratory for Lingnan Modern Agriculture, South China Agricultural University, Guangzhou 510642, China\nJoint Laboratory of Guangdong Province and Hong Kong Region on Marine Bioresource Conservation and Exploitation, College of Marine Sciences, South China Agricultural University, Guangzhou 510642, China; hry@scau.edu.cn (H.Y.); glchen@scau.edu.cn (G.C.)\nGuangdong Laboratory for Lingnan Modern Agriculture, South China Agricultural University, Guangzhou 510642, China\nCopyright and License information\nJoint Laboratory of Guangdong Province and Hong Kong Region on Marine Bioresource Conservation and Exploitation, College of Marine Sciences, South China Agricultural University, Guangzhou 510642, China; hry@scau.edu.cn (H.Y.); glchen@scau.edu.cn (G.C.)\nGuangdong Laboratory for Lingnan Modern Agriculture, South China Agricultural University, Guangzhou 510642, China\nwangjun2016@scau.edu.cn\n; Tel./Fax: +86-20-8757-1321\nReceived 2021 Jan 27; Accepted 2021 Feb 19; Collection date 2021 Feb.\n© 2021 by the authors.\nLicensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license (\nhttp://creativecommons.org/licenses/by/4.0/\nPMCID: PMC7927104  PMID:\nThe serious global microplastic pollution has attracted public concern in recent years. Microplastics are widely distributed in various environments and their pollution is already ubiquitous in the ocean system, which contributes to exponential concern in the past decade and different research areas. Due to their tiny size coupled with the various microbial communities in aquatic habitats capable of accumulating organic pollutants, abundant literature is available for assessing the negative impact of MPs on the physiology of marine organisms and eventually on the human health. This study summarizes the current literature on MPs in the marine environment to obtain a better knowledge about MP contamination. This review contains three sections: (1) sources and fates of MPs in the marine environment, (2) impacts of MPs on marine organisms, and (3) bacteria for the degradation of marine MPs. Some measures and efforts must be taken to solve the environmental problems caused by microplastics. The knowledge in this review will provide background information for marine microplastics studies and management strategies in future.\nsource, fate, bacterial degradation, marine environment, microplastics\nPlastics have brought a lot of benefits to modern life, driving the tremendous growth in plastic demand, because of their low cost, light weight, and durable character [\n]. It was reported that 3 billion tons of plastic were manufactured in 2016, and every year, some 8 million tons of plastics will eventually enter the marine environment [\n]. One of the consequences of this accumulation in the marine environment is the low percentage of recycled plastics [\n] as just 9.4 million tonnes of plastic postconsumer waste were collected in Europe to be recycled in 2018 (both inside and outside the Europe) [\n]. Plastic pollution is already ubiquitous in the ocean environment. Most worrying of all, it was estimated that the weight of plastics in the ocean will be more than that of the fish by 2050 [\nMicroplastics (MPs) are plastic fragments or particles with a diameter of less than 5 mm formed by fragmentation of larger plastics [\n]. Plastics can fragment into smaller particles in the marine environment [\n]. Microplastics appear in various shapes, such as foils, foams, fibers, pellets, fragments and microbeads [\n]. Generally, plastics are chemically diverse. The density of polyamide (PA), polyvinylchloride (PVC), and polyethylene terephthalate (PET) are higher than that of seawater, increasing the settlement rates in sediments, while polystyrene (PS), high-density polyethylene (HDPE), low-density polyethylene (LDPE), polypropylene (PP) and polyurethane (PUR) with lower densities might float mainly on seawater [\nThe basic characteristics of microplastic about size, type, shape, source and fate.\nMicroplastics are prevalent in the environment, especially the marine environment, due to hydrodynamic processes, transportation by wind and ocean currents, ranging from the large ocean gyres such as the Pacific Ocean [\n], the Atlantic Ocean [\n], Indian Ocean [\n]. It was estimated that more than 15 trillion microplastics were present in the global ocean in 2014, weighing more than 93 thousand metric tons [\n]. MPs are abundant in the Great Pacific Garbage Patch, with about 1.69 trillion (94%) floating pieces [\n] that are microplastics. Generally, microplastics pollution is already a ubiquitous presence in the ocean environment, which contributes to exponential public and scientific concern in last decade and different research areas (\nThe record count and the percentage of total publications in the top 40 research areas related to the assessment of the microplastic effects on organisms and bacterial degradation over time. Source: Web of Science; Period: 1944–2020; Total Publications: 4685; h-index: 162; Average citations per item: 29.31; Sum of Times Cited: 137,315 (without self-citations: 53,749); Citing articles: 32,830 (without self-citations: 29,560). TS = (microplastic * OR micro-plastic * OR plastic particle * OR plastic particulate OR plastic debris OR plastisphere * OR microplastic pollution *) AND (source * OR fate * OR occurrence * OR distribute * OR influence * OR impact * OR affect OR risk * OR effect * OR exposure * OR exposed OR colonize OR colonization OR bacteria * OR germ * OR microbiological OR microorganisms OR microbial OR microbiota OR macrobiotic OR biotechnological OR degrade * OR degradation * OR biodegradation * OR biodegrade * OR organisms * OR creature * OR biota * OR habitat *) AND (marine * OR ocean * OR sea * OR seawater * OR beach * OR shore * OR coast * OR seacoast * OR seaboard *).\nDue to their tiny size, MPs can be ingested accidentally by marine species [\nThe ecological threat of MPs to the oceanic environment and their health risk to organisms have not been fully clarified, but given the sharply increasing amount of evidence about the presence and effects of MPs in the marine environment, MP pollution has become a great environmental concern [\n]. Some measures and efforts must be taken to solve the problems caused by microplastics and improve plastic waste management.\nThe present review will summarize existing research on MPs in the marine environment to provide a better understanding about MPs contamination in marine environment. This review contains three sections: (1) sources and fates of MPs in marine environment, (2) impacts of MPs on marine organisms, and (3) bacteria for the degradation of marine MPs.\n2. Sources and Fates of MPs in Marine Environment\n2.1. Sources of marine MPs\nMarine microplastic pollution originates from a variety of sources and can generally be divided into inland-based, sea-based and air-based sources [\n). Rivers are considered to be the most important pathways for microplastics to be transported from inland areas to the ocean [\n]. About 80% of the plastic pieces in the ocean originated from the terrestrial environment [\n]. Plastic debris in municipal drainage systems and sewage effluents, or improper management of inland areas is blown into the sea through rivers, and plastic waste from beach-related tourism is discarded directly into the environment [\n]. Sea-based sources originate from fishing, shipping and offshore industries [\n]. The emissions and leaks of large shipping are considered as an important source of microplastics [\n]. Loss and damage of fishing and aquaculture equipment can easily introduce plastic particles into the ocean [\n]. Followed by marine aquaculture, the main offshore source is the world’s fishing fleet [\n], garbage illegally discarded from ships or offshore platforms [\n], and a large proportion of items comes from lost containers [\n]. In addition, airborne MPs are also important sources [\nAccording to their original sizes, microplastics can be divided into two groups. Originally designed plastic microbeads, industrially produced particles and powders (<5 mm in diameter) could enter the ocean directly through sewage effluent, which is called primary microplastics [\n]. When subjected to the combined effects of physical, biological and chemical processes, large plastic fragments are broken down and degraded into tiny fragments, which are secondary microplastics and can be transported to the marine environment [\n]. Primary microplastics are widely used in personal hygiene products containing abrasives and scrubs (like toothpastes, hand and facial cleansers; shower gels and air-blasting aids, etc.) [\n], cosmetics formulations (such as eye shadow, nail polish, hair coloring, etc.) [\n], and also fiber and textile manufacture [\nGenerally, secondary microplastics imply the breakdown of large plastic debris due to biological, chemical and physical degradation, which are representative of microbial species biodegradation, photodegradation (solar ultraviolet radiation) and mechanical abrasion (wave action), respectively. Plastic debris in the ocean are subject to mechanical damage and photodegradation well as oxidative degradation, which break down fragile plastics into microplastics [\n]. Besides, microplastics can further degrade to nano-scale plastic pieces [\n]. These microplastics and nanoplastics are more easily ingested and will have long-term adverse impacts on the marine environment, making them become a public concern in the future [\n2.2. Fates of Marine MPs\nGenerally, debris in any water body will ultimately enter the ocean. Transported by water power and wind power, microplastics gradually migrate and diffuse through the ocean, eventually becoming as ubiquitous as they are today, ranging from the large ocean gyres (e.g., the Pacific Ocean [\n]; the Atlantic Ocean [\n]; Indian Ocean [\n]) to the polar regions and equator, from densely populated areas to remote islands, and from beaches down to the abysses of the sea [\n]. They come in various shapes, with fibers being the most common form, followed by fragments. Marine circulation, estuaries and other coastal areas where humans are active are the ecosystems most seriously polluted by microplastics [\n]. Approximately 70% of marine plastic debris is deposited in sediments, 15% floats in coastal areas and the remainder float on the surface seawater (\n). Microplastics will be accumulated in the global ocean circulation, since some of them are less dense than seawater and float on the sea surface, and the converging sea currents concentrate and retain debris for a long time [\n]. According to the surveys, there are only at least 7000 tonnes of plastic debris on the surface of the high seas [\n], but at least 4.8 million tonnes of plastic debris enter the marine environment each year [\n], which is inconsistent with data on surface plastics, suggesting that a significant number of plastics sinks to unknown depths. Microplastics have even been found on the seafloor at 2200–10,000 m depth, containing both high [\n] density (relative to seawater) microplastics. This indicates that the migration of microplastics is a dynamic process, which may not only be carried to every part of the marine through physical effects such as crushing and coastal deposition, but also through chemical processes such as oxidation or hydrolysis [\n], and may also be carried to every part of the ocean through biological absorption, digestion and excretion [\nWeathering processes, biodegradation processes, oxidative and hydrolytic degradation [\n] and hetero-aggregation and biofilm formation [\n] could significantly affect the fate of microplastic pieces in the oceanic environment (\n). Biological pollution and subsequent chemical deposition of plastics, could dominate migration in seawater environments [\n]. Therefore, according to biofilm growth, sedimentation and marine depth distribution of various physical factors such as light, salinity, water density, temperature, and viscosity, a theoretical predicted model was established to simulate the impact of biological pollution on the migration of microplastics, and forecast the size-dependent vertical migration of sea microplastics [\nIn addition to the origin and fate of MPs, many papers have also focused on the particle size, shape, type, color and mesh size of MPS and how to sample it to fully understand the characteristics of MPS in marine ecosystems (\n). This information will be helpful for further evaluation of plastic production plans and for more scientific and effective control of plastic products [\nThe characterization of MPs in marine ecosystem.\nNorth African coasts of Mediterranean\n649.33 ± 184.02/kg sediment DW\nfibers (70%), fragments (21%), pellets (5%), films (2%) and foams (2%)\nPE (48%), PP (16%), PET (14%), PS (9%), butyl branham (7%), EPM (3%), TCA (3%)\n1.19 ± 0.28 items/L (EGC), 2.43 ± 0.84 items/L (GSG)\nfiber (76.1%), transparent (76.2%), small microplastics (48.1%)\nPA, PE, PET, PMMA, PP, PS,\nTerra Nova Bay, Antarctica\n1.0 items/individual, 0.7 items/mg DW\nnylon (86%), polyethylene (5%)\nPAA, PARA, PA, PP, PS, PTFE\nSouthern Caspian coastal northern, Iran\nfiber, fragment, film\nBanten Bay, Indonesia\nmean: 267 ± 98 particles/kg DW, min: 101 particles/kg DW, max: 431particles/kg DW\n500 and 1000 μm (>50%)\nfoam (30.4%), fragments (26.5%), granules (24.4%), and fibers (18.7%)\n1–4.75 mm in surface water (68%) and coastal sediments (50%)\nfragment (38%), styrofoam (31%), film (20%), lines (9%) (surface water)\nstyrofoam (35%), fragment (31%) (sediment)\nmean: 674.13 particles/km\n, min: 5.73 particles/m\n, max: 2697 particles/m\nNorthwestern Pacific Ocean\n0.5–1.0 mm (50%), 1–2.5 mm (29.8%), 2.5–5.0 mm (17.6%)\ngranules (39.7%) sheets (26.7%), films (24.7%), and lines (8.9%)\nPE (57.8%), PP (36.0%), PA (3.4%)\nfragment (94%), sphere (5.2%), fiber (0.5%)\nPS, PP, PE, oxidized PE, LDPE\nIrish Continental shelf, Atlantic\n23% PA, 11%PET, 3% PP, 2% acrylic\nDeep–sea of Mid–Atlantic and Indian Ocean\nfound inside oral or stomach area\nModified acrylic, PP, PET, viscose, acrylic\nsurface and subsurface water\nNE Pacific Ocean\nContinental shelf (Belgium)\nfibers (59%), granules (25%)\nContinental shelf (UK)\nPE: polyethylene; PP: polypropylene; PS: polystyrene; EPM: ethylene propylene diene; TCA: tricellulose acetate; PA: polyamide; PET: polyethylene terephthalate; PMMA: poly methyl methacrylate; PAA: poly (acrylic acid); PARA: polyaryl amide; PTFE: polytetrafluoroethylene; LDPE: low-density polyethylene; PVC: polyvinyl chloride. NA: Not available.\n3. Impacts on Marine Organisms of MPs\nRecently, abundant literature has assessed the accumulation of microplastics in marine organisms through direct contact [\n] or food chain exposure [\n] to MPs. MPs are ingested by organisms and have negative effects on their development, metabolism, reproduction and cellular response, and so on [\nBasically, there are two primary modes of MP exposure for marine organisms: bathing contact and ingestion. Bathing, of course, is the most common contact method in MP bioassays of natural marine environments, making it possible to study the various adverse effects caused by microplastics on the aquatic organisms through contact [\n]. For example, microplastics could attach to the surface of skin, crust and ectoderm of\n]. Besides, microplastics could be ingested by low-nutrient organisms (like zooplankton such as artemia [\n] and larvae of various marine animals such as shellfish and sea squirts [\n], which are more readily available and easily exposed to suspended microplastics, since microplastics are similar than planktonic organisms and sediments in size and density [\nMicroplastics are found in the circulatory system and tissues of some marine organisms because they could pass through epithelial tissues and even cell membranes. This phenomenon was called “translocation” [\n]. For example, after a 3 h exposure, HDPE was detected in mussels’ stomachs and accumulated in the lysosomal system [\n]. Since microplastics cannot be digested or absorbed, they can pass through cell membranes, transport through the inner layer of intestinal epithelium into the circulatory system and enter tissues after ingestion [\n]. Therefore, MPs could be translocated and accumulated in cells and specialized tissues, such as gills and guts [\n], lysosomal system and hemolymph in blood cells [\nTranslocation efficiency depends mainly on the size of the MPs, but is also biologically affected by other factors, such as shape, concentration and the related organisms [\n]. MP < 10 μm may be compatible with the use of membrane surface recognition elements through the epithelium [\n]. As the size of microplastics decreases, the ability for microplastics to accumulate in marine organisms may increase, because the smaller the microplastics, the easier their transport. Currently, one of the main techniques for studying translocation is to expose organisms to fluorescently labeled plastic particles and then use a microscope (e.g., fluorescence and confocal microscopy) to observe MPs in the tissue, as well as do the quantitative analysis through flow cytometry [\n3.3. Bioaccumulation and Bioavailability\nThe two important indexes to access the impacts of MPs to organisms are bioaccumulation and bioavailability [\n]. There are interactions between MPs and organisms in the marine environment [\n]. Microplastics can be ingested directly by marine organisms or transferred and accumulated in the food web from lower trophic organisms to higher trophic organisms, and the higher the trophic level, the more microplastics may be enriched in the organism [\n]. In addition, toxic pollutants could be transported and accumulated in organisms along with microplastics through the ingestion, which has been demonstrated during experimental exposure tests. It has been speculated that POPs could be significantly bioaccumulated in the food web via microplastics [\nThe bioaccumulation of MPs has been identified in the digestive tract such as the oral area [\n], gastrointestinal tract [\n] of marine organisms, and followed by translocation to the circulatory system, other specific tissues and cells [\n]. According to Bottari et al., fibrous microplastics are found in the digestive systems of\n]. Microplastics have been reported to be found in fish populations at the bottom of the Mediterranean, with PE accounting for the largest proportion [\n]. Furthermore, it has been reported that when\ningest microplastics, the particles accumulate in the liver, accompanied by oxidative stress [\n]. Even some endangered species, such as bluefin tuna, have been found to have microplastics in their bodies, which raises concerns about the extent of microplastics pollution in marine species [\nBioavailability strongly relies on the physiochemical properties of microplastics, like their size, shape, and density [\n]. The conclusion is that the size of microplastics is the most important factor. As the size decreases, the potential of bioaccumulation and bioavailability increase [\n], because microplastics with smaller size are similar to planktonic organisms, and could be easily mistakenly ingested by zooplankton [\n]. The irregular shape of plastic particles or fibers results in different bioavailability [\nAdditionally, biological factors could increase the microplastic bioavailability. MPs egested within fecal matter might be ingested by subsequent detritivores and suspension feeders [\n], then be cast up on the benthos, attracted to the sediment, and MPs could be available for infauna, sediment-dwelling organisms capable of bioturbation [\n]. Furthermore, their bioavailability in the water column is also influenced by biological fouling and aggregation, and after decontamination, they float at the sea-air interface [\n] or sink below the marine surface, due to reduced buoyancy [\nMicroplastics could enhance the bioavailability of adsorbed pollutants, which has attracted more interest from scientists [\n]. Unfortunately, due to the very high number of possible interaction factors, including physical (e.g., salinity, pH, and temperature), chemical (e.g., hydrolysis, oxidation, reduction and enrichment) and biological factors (e.g., organisms variables), it is difficult to assess how the bioavailability of pollutants enhanced by microplastics [\nMicroplastics have toxic effects on marine organisms. Different types and sizes of microplastics have different toxic effects on marine species, which are ultimately reflected in the physiological response of organisms and the damage they are subjected to [\n). In addition, different microplastics also adsorb different pollutants, which combine to further damage the health of living marine organisms [\nEffects of microplastics and nanoplastics on marine organisms\nChaetoceros neogracile\nParticles decrease chlorophyll content, esterase activity, cell growth and photosynthetic efficiency of diatoms.\nInhibition of multiple resistance to p-glycoproteins and multidrug resistant proteins leads to increased toxicity and oxidative stress damage to membrane lipids.\nParticles reduce fertilization rate and development ability of embryo and larva.\nMytilus galloprovincialis\nIncreased total oxidant status of digestive glands, influence neurotransmission, genotoxicity and lipid peroxidation.\nAlter immune response, lysosomal compartment, peroxisome, antioxidant system, and neurotoxic effects\nImpairment of feeding ability, behavioral ability and physiological conditions.\nAlter predation behavior, reduce fat storage, and affect growth and development.\nProduce cell death and affect energy metabolism.\nOxidative stress and inflammation reaction.\nGlucodermatin receptors disrupt glucose homeostasis, leading to abnormal larval activity.\nInflammatory reaction.\nChange the activity of superoxide dismutase and Glutathione S-transferase and the toxicity of drugs.\nPS: polystyrene; PE: polyethylene; LDPE: low-density polyethylene; HDPE: high-density polyethylene; PA: polyamide; PP: polypropylene; PUR: polyurethane; PET: polyethylene terephthalate; PVC: polyvinyl chloride. PAHs: polycyclic Aromatic Hydrocarbons; BPA: bisphenol A; Cbz: carbamazepine. NA: Not available.\n3.4.1. Physiological Impacts\nSome morphological changes were detected in the marine phytoplankton when they ingested microplastics. For example, some thylakoids were deformed and cell walls were thickened [\n], algae homo-aggregation and algae-microplastics hetero-aggregation [\n], as well as expression of certain chloroplast genes was reduced [\nAs for the development, studies examining the impact of MPs have reported significant effects on the development of marine zooplankton and other invertebrates, such as dry weight loss in lugworms [\n], intergenerational developmental responses in copepods [\n], anomalous growth delays in juvenile [\n] development in sea urchins and ascidians, development parameter alteration in shellfish [\n], malformations or dead embryos [\n], embryonic development abnormalities [\n] dependent manner in larvae and adults of different invertebrates. Particularly, the microplastics in the larvae of marine organisms will seriously affect the normal growth of the organism and sometimes microplastics might even cause death, due to their limited abilities to control their internal environment [\n]. It was reported that the molting times of the larvae increased significantly in a short period of time after ingesting microparticles [\n] and that microparticles had a restrictive effect on their feeding, that is, the microparticles had a sublethal effect on the larvae [\n]. Studies have shown that after worms’ ingestion of microplastics, their energy reserves are significantly reduced and particles accumulate in the intestines where they induce inflammation [\nThe effects of microplastics on oxidative stress, inflammatory reactions and metabolic disorders of marine animals were studied. For example, the accumulation of MPs may result in inflammation, lipid accumulation and energy metabolism in fish [\n], while oxidative stress and enzyme activity reductions occur in crabs [\nThe adverse impact of microplastic on the reproduction in marine animals, such as egg production [\n], fertilization rates [\n] and population growth rate [\n] were assessed with significant dose-dependent [\n] and distinct size-dependent effects [\n] being observed in marine invertebrates studies.\nAt the cellular level, exposure marine animals to MPs induced comprehensive cellular responses. Microplastics could significantly down-regulate histone 3 gene expression [\n], and up-regulate Abcb1, cas-8 [\n], sod, gpx, idp, pk [\n] gene expression. Besides, the activity of phagocytes and mitochondria is significantly increased, and the proportion of oxy radical and immune cells is also up-regulated [\n3.4.2. Joint Toxicity\nDue to the high adsorption capacity of microplastics, many hydrophobic pollutants could adsorb and accumulate on microplastics and accompanied by biomagnification (e.g., PAHs, PCBs, nonylphenols, pesticides, dioxins) [\n]. Studies have shown that millimeter-sized microplastics have no obvious adsorption toxicity, while micron-sized or even nanosized microplastics have a relatively strong ability to absorb pollutants [\n]. For heavy metal pollutants, 32–40 μm plastic particles exposed to heavy metals induce oxidative stress in fish and stimulate their innate immunity [\n]. As for organic pollutants, there are studies that have shown that 50 nm plastic particles exposed to PAHs are obviously toxic to aquatic zooplankton and cause significant chemical damage [\n]. The biological amplification of organic pollutants becomes higher because plastics reduce the metabolism of pollutants, and the combined toxicity presents an additive effect [\nIn addition to the original monomer, many microplastic products also contain a variety of additives, such as flame retardants, plasticizers, dyes and antioxidants, which make microplastics display joint toxicity with the additives [\nThe accumulation and biomagnification of microplastics and their surface-adsorbed pollutants need to be further studied. The joint toxicity may pose a persistent threat to marine ecosystems, due to the durability of microplastics and toxic chemicals [\n]. Because the toxicity mechanism of microplastics is not fully clear, understanding toxic effects caused by microplastics is important to assess their environmental impacts.\n4. Bacteria for Degradation of Marine MPs\n4.1. Bacteria Colonizing Microplastics\nSome studies highlight the differences between the bacteria living on organic particles with seawater [\n], on microplastics and in a free state [\n]. The bacterial community that settles on the surfaces of marine microplastic is significantly different from that in surrounding middle and upper waters or other particle types [\n]. If these bacteria have been established enzymatic mechanism for degrading plastic, they would be of particular interest for bioremediation and bioengineering.\nStudies show that some bacterial groups such as the phyla\nappear to colonize microplastics more often than others, indicating that the specific taxonomic bacteria consider microplastics as a beneficially ecological niche and a potential metabolic adaptation to the material (e.g., attachment, additive resistance, chemotaxis, and degradation). Similar taxa belonging to Bacteroidetes and Proteobacteria seem to be shared by the core bacteria of the seafloor and subsurface plastisphere share, and some photoautotrophic bacteria dominated the sub-surface communities [\n4.2. Plastisphere Served as a New Niche for Marine Environment\nRecently, the first study using the modern technology of large-scale DNA sequencing gave a detailed image of the microbial communities that inhabit microplastics [\n]. Debris is usually described by the term “plastisphere” in marine biology research [\n], they serve as various habitats for microbial colonies in aquatic environments besides accumulating organic pollutants [\nBased on morphological data and DNA sequencing technology, the factors that drive the composition of plastisphere are complex and comprehensive. In addition to the main factors, season and surrounding environment, polymer type, surface feature, and size also affected the diversity and abundance of the colonizing bacterial groups [\n]. For example, studies highlighted significant differences in microbiota communities on microplastics from the two different oceans, and the diversity of bacteria living in water columns and bacteria attached to microplastic debris [\n]. Studies show that plastic surfaces could be rapidly colonized by heterotrophic bacteria, which can survive longer than in the surrounding aquatic environments [\n4.3. Biodegradation of Bacteria in Marine Environment\nMicrobial biodegradation is a process in which microbial communities (bacteria, actinomycetes and fungi) use organic matter as a carbon source to metabolize, resulting in a transformation from organic carbon to biogas and biomass [\n]. Generally, the biodegradation process of MPs is proposed to consist of four main basic stages and continuous successive steps: biodeterioration, biofragmentation, assimilation and mineralization [\nInterest in plastic biodegradation is also growing, and bacteria are considered to be one of the most important ways to solve marine plastic pollution, because of their potential capacity for biodegradation of plastic wastes.\nare the main bacterial groups in this context, and they can use plastics as sole carbon source under lab conditions [\n]. Interestingly, it was discovered that significant differences exist in the diversity, abundance and activity of bacterial and physiochemical characters of plastics between biodegradable and non-biodegradable plastics, indicating the presence of plastic-degrading microbes [\n]. Nowadays, there is an increasing number of anecdotal evidence that bacteria can show the capability to degrade ocean plastic pieces [\nOutstanding plastic-degrading bacteria in existing research.\nPlastic Types\nPlastic Forms\n(7.4% ± 0.4%)/60 days\nPlodia interpunctella Hübner\n(10.7% ± 0.2%)/60 days\nPlastic waste landfill in Mannar, India\nHydrolysis of polymer hydrolases\nComamonas acidovorans TB-35\nHydrolysis of esterase encoded by gene\nPseudomonas putida A12\nHydrolysis of a 45 kDa esterase\nHydrolysis of esterase\nHydrolysis of p-nitrobenzylesterase\nPS: polystyrene; PE: polyethylene; LDPE: low-density polyethylene; HDPE: high-density polyethylene; PA: polyamide; PP: polypropylene; PUR: polyurethane; PET: polyethylene terephthalate; PVC: polyvinyl chloride. NA: not available.\nThe factors involved in plastic biodegradability depend not only on the ability of microorganisms but also on the characteristics and surface structure of the material, such as the roughness, electrostatic interactions, topography, hydrophobicity, and free energy [\n]. In addition, various environmental factors, such as oxygen level, temperature, humidity, salinity, and limitation of light have an important impact on the biodegradation of plastics [\n]. The additives in the polymer could increase the rate of biodegradability. These additives will affect their chemical and thermal sensitivity as well as their ability to absorb ultraviolet light and lead to the loss of stable properties that are more suitable for microbial attachment [\nThe current test standards for assessing plastic biodegradability of marine plastics tend to use to use optical, atomic force and scanning electron microscopy to confirm the results of major tests based on respirometers, since each of them has limitations, and none of these techniques are sufficient by itself [\n]. To date, standard guidelines and methods for conducting these experiments have not been established.\nOur understanding of metabolic mechanisms of biodegradable marine bacteria and their enzymes is very limited. Furthermore, the biodegradation mechanics of marine plastic debris and its potential impact processes need further research to make full use of its impact.\nThe accumulation of microplastics in the marine environment is a serious threat to the health of marine organisms, which may eventually affect the survival of human beings. Therefore, it has attracted extensive attention from society and researchers. Many studies have shown that different bacterial communities colonize microplastics in the marine environment, which has inspired us to investigate the bacterial degradation of marine microplastics. However, until now, we don’t know much about how these bacteria work. The rich diversity and activity of these bacteria indicate their potential in the biogeochemical cycling of plastics, but further research is needed. Contact experiments must be carefully designed to test the ability of these bacteria to react with plastics and adapt to changing marine environments, so it is important to integrate research approaches from multiple disciplines. In order to take full advantage of the influence of bacterial communities on MPs, more controlled experiments are needed to simulate real marine ecosystems. Further studies of bacteria associated with plastic degradation will help develop situ biodegradable methods and materials. According to the current technology and methods, it is impossible to completely remove all the microplastics in the ocean, but we can still try to partially reduce marine microplastic pollution. Bacterial degradation is an appropriate choice for this. While developing methods for degrading plastics, relevant stakeholders such as governments, the public, manufacturers and scientists should pay high attention to the problem of marine microplastics pollution. We should take responsibility and working together to reduce unnecessary plastic production and reduce plastic waste by recycling plastic to tackle increasing MP issues.\nWe appreciate the provision of SCAU Wushan Campus Teaching & Research Base.\nConceptualization, J.W. and H.Y.; formal analysis, G.C.; investigation, G.C.; data curation, H.Y.; writing—original draft preparation, H.Y.; writing—review and editing, J.W. and G.C.; visualization, J.W.; supervision, J.W. and H.Y.; project administration, J.W. and H.Y.; funding acquisition, J.W. and H.Y. All authors have read and agreed to the published version of the manuscript.\nThis research was funded by the National Key Research and Development Program of China (2018YFD0900604), Guangdong Forestry Science and Technology Innovation Project, Provincial Projects with Special Funds for Promoting Economic Development of Marine and Fisheries Department of Guangdong (SDYY-2018-05), Project of Guangzhou Association for Science & Technology (K20200102008); Guangdong Province Universities and Colleges Pearl River Scholar Funded Scheme (2018), the National Natural Science Foundation of China (42077364), and Key Research Projects of Universities in Guangdong Province (2019KZDXM003 and 2020KZDZX1040).\nConflicts of Interest\nThe authors declare no conflict of interest. The authors themselves are responsible for the content and writing of the paper.\nMDPI stays neutral with regard to jurisdictional claims in published maps and institutional affiliations.\nAndrady A.L., Neal M.A. Applications and societal benefits of plastics. Philos. Trans. R. Soc. Lond. B Biol. Sci. 2009;364:1977–1984. doi: 10.1098/rstb.2008.0304.\nThompson R.C., Swan S.H., Moore C.J., vom Saal F.S. Our plastic age. Philos. Trans. R. Soc. B. 2009;364:1973–1976. doi: 10.1098/rstb.2009.0054.\nImran M., Das K.R., Naik M.M. Co-selection of multi-antibiotic resistance in bacterial pathogens in metal and microplastic contaminated environments: An emerging health threat. Chemosphere. 2019;215:846–857. doi: 10.1016/j.chemosphere.2018.10.114.\nLaw K.L. Plastics in the Marine Environment. Ann. Rev. Mar. Sci. 2017;9:205–229. doi: 10.1146/annurev-marine-010816-060409.\nDris R., Imhof H., Sanchez W., Gasperi J., Galgani F., Tassin B., Laforsch C. Beyond the ocean: Contamination of freshwater ecosystems with (micro-)plastic particles. Environ. Chem. 2015;12 doi: 10.1071/EN14172.\nHahladakis J.N., Velis C.A., Weber R., Iacovidou E., Purnell P. An overview of chemical additives present in plastics: Migration, release, fate and environmental impact during their use, disposal and recycling. J. Hazard. Mater. 2018;344:179–199. doi: 10.1016/j.jhazmat.2017.10.014.\nPlastics Europe  Plastics—The Facts 2020 An Analysis of European Plastics Production, Demand and Waste Data. Plastics Europe.  [(accessed on 22 January 2021)];2020  Available online:\nhttps://www.plasticseurope.org/en/resources/publications/4312-plastics-facts-2020\nRocha-Santos T.A.P. Editorial overview: Micro and nano-plastics. Curr. Opin. Environ. Sci. Health. 2018;1:52–54. doi: 10.1016/j.coesh.2018.01.003.\nLaw K.L., Thompson R.C. Microplastics in the seas. Oceans. 2014;345:144–145. doi: 10.1126/science.1254065.\nLebreton L., Slat B., Ferrari F., Sainte-Rose B., Aitken J., Marthouse R., Hajbane S., Cunsolo S., Schwarz A., Levivier A., et al.  Evidence that the Great Pacific Garbage Patch is rapidly accumulating plastic. Sci. Rep. 2018;8 doi: 10.1038/s41598-018-22939-w.\nWright S.L., Thompson R.C., Galloway T.S. The physical impacts of microplastics on marine organisms: A review. Environ. Pollut. 2013;178:483–492. doi: 10.1016/j.envpol.2013.02.031.\nGESAMP  Sources, Fate and Effects of Microplastics in the Marine Environment: Part 2 of A Global Assessment.  [(accessed on 21 February 2021)];2016  Available online:\nhttp://www.gesamp.org/publications/microplastics-in-the-marine-environment-part-2\nGalgani F., Hanke G., Werner S., De Vrees L. Marine litter within the European Marine Strategy Framework Directive. ICES J. Mar. Sci. 2013;70:1055–1064. doi: 10.1093/icesjms/fst122.\nPellini G., Gomiero A., Fortibuoni T., Ferra C., Grati F., Tassetti A.N., Polidori P., Fabi G., Scarcella G. Characterization of microplastic litter in the gastrointestinal tract of Solea solea from the Adriatic Sea. Environ. Pollut. 2018;234:943–952. doi: 10.1016/j.envpol.2017.12.038.\nGalloway T.S., Cole M., Lewis C. Interactions of microplastic debris throughout the marine ecosystem. Nat. Ecol. Evol. 2017;1:116. doi: 10.1038/s41559-017-0116.\nGigault J., ter Halle A., Baudrimont M., Pascal P.Y., Gauffre F., Phi T.L., El Hadri H., Grassl B., Reynaud S. Current opinion: What is a nanoplastic? Environ. Pollut. 2018;235:1030–1034. doi: 10.1016/j.envpol.2018.01.024.\nHidalgo-Ruz V., Gutow L., Thompson R.C., Thiel M. Microplastics in the marine environment: A review of the methods used for identification and quantification. Environ. Sci. Technol. 2012;46:3060–3075. doi: 10.1021/es2031505.\nKlein S., Worch E., Knepper T.P. Occurrence and Spatial Distribution of Microplastics in River Shore Sediments of the Rhine-Main Area in Germany. Environ. Sci. Technol. 2015;49:6070–6076. doi: 10.1021/acs.est.5b00492.\nAuta H.S., Emenike C.U., Fauziah S.H. Distribution and importance of microplastics in the marine environment: A review of the sources, fate, effects, and potential solutions. Environ. Int. 2017;102:165–176. doi: 10.1016/j.envint.2017.02.013.\nDuis K., Coors A. Microplastics in the aquatic and terrestrial environment: Sources (with a specific focus on personal care products), fate and effects. Environ. Sci. Eur. 2016;28:2. doi: 10.1186/s12302-015-0069-y.\nRevel M., Chatel A., Mouneyrac C. Micro (nano) plastics: A threat to human health? Curr. Opin. Environ. Sci. Health. 2018;1:17–23. doi: 10.1016/j.coesh.2017.10.003.\nRauscher H., Sokull-Kluttgen B., Stamm H. The European Commission’s recommendation on the definition of nanomaterial makes an impact. Nanotoxicology. 2013;7:1195–1197. doi: 10.3109/17435390.2012.724724.\nEriksen M., Mason S., Wilson S., Box C., Zellers A., Edwards W., Farley H., Amato S. Microplastic pollution in the surface waters of the Laurentian Great Lakes. Mar. Pollut. Bull. 2013;77:177–182. doi: 10.1016/j.marpolbul.2013.10.007.\nCozar A., Marti E., Duarte C.M., Garcia-de-Lomas J., van Sebille E., Ballatore T.J., Eguiluz V.M., Gonzalez-Gordillo J.I., Pedrotti M.L., Echevarria F., et al.  The Arctic Ocean as a dead end for floating plastics in the North Atlantic branch of the Thermohaline Circulation. Sci. Adv. 2017;3 doi: 10.1126/sciadv.1600582.\nReddy M.S., Basha S., Adimurthy S., Ramachandraiah G. Description of the small plastics fragments in marine sediments along the Alang-Sosiya ship-breaking yard, India. Estuar. Coast. Shelf Sci. 2006;68:656–660. doi: 10.1016/j.ecss.2006.03.018.\nBergmann M., Sandhop N., Schewe I., D’Hert D. Observations of floating anthropogenic litter in the Barents Sea and Fram Strait, Arctic. Polar Biol. 2016;39:553–560. doi: 10.1007/s00300-015-1795-8.\nPeeken I., Primpke S., Beyer B., Gutermann J., Katlein C., Krumpen T., Bergmann M., Hehemann L., Gerdts G. Arctic sea ice is an important temporal sink and means of transport for microplastic. Nat. Commun. 2018;9 doi: 10.1038/s41467-018-03825-5.\nWaller C.L., Griffiths H.J., Waluda C.M., Thorpe S.E., Loaiza I., Moreno B., Pacherres C.O., Hughes K.A. Microplastics in the Antarctic marine system: An emerging area of research. Sci. Total Environ. 2017;598:220–227. doi: 10.1016/j.scitotenv.2017.03.283.\ndo Sul J.A.I., Spengler A., Costa M.F. Here, there and everywhere. Small plastic fragments and pellets on beaches of Fernando de Noronha (Equatorial Western Atlantic) Mar. Pollut. Bull. 2009;58:1236–1238. doi: 10.1016/j.marpolbul.2009.05.004.\nClaessens M., De Meester S., Van Landuyt L., De Clerck K., Janssen C.R. Occurrence and distribution of microplastics in marine sediments along the Belgian coast. Mar. Pollut. Bull. 2011;62:2199–2204. doi: 10.1016/j.marpolbul.2011.06.030.\nMartin J., Lusher A., Thompson R.C., Morley A. The Deposition and Accumulation of Microplastics in Marine Sediments and Bottom Water from the Irish Continental Shelf. Sci. Rep. 2017;7:10772. doi: 10.1038/s41598-017-11079-2.\nTaylor M.L., Gwinnett C., Robinson L.F., Woodall L.C. Plastic microfibre ingestion by deep-sea organisms. Sci. Rep. 2016;6:33997. doi: 10.1038/srep33997.\nVan Cauwenberghe L., Vanreusel A., Mees J., Janssen C.R. Microplastic pollution in deep-sea sediments. Environ. Pollut. 2013;182:495–499. doi: 10.1016/j.envpol.2013.08.013.\nvan Sebille E., Wilcox C., Lebreton L., Maximenko N., Hardesty B.D., van Franeker J.A., Eriksen M., Siegel D., Galgani F., Law K.L. A global inventory of small floating plastic debris. Environ. Res. Lett. 2015;10 doi: 10.1088/1748-9326/10/12/124006.\nGoldstein M.C., Titmus A.J., Ford M. Scales of spatial heterogeneity of plastic marine debris in the northeast pacific ocean. PLoS ONE. 2013;8:e80020.  doi: 10.1371/journal.pone.0080020.\nWright S.L., Rowe D., Thompson R.C., Galloway T.S. Microplastic ingestion decreases energy reserves in marine worms. Curr. Biol. 2013;23:R1031–R1033. doi: 10.1016/j.cub.2013.10.068.\nLusher A.L., McHugh M., Thompson R.C. Occurrence of microplastics in the gastrointestinal tract of pelagic and demersal fish from the English Channel. Mar. Pollut. Bull. 2013;67:94–99. doi: 10.1016/j.marpolbul.2012.11.028.\nBrowne M.A., Dissanayake A., Galloway T.S., Lowe D.M., Thompson R.C. Ingested microscopic plastic translocates to the circulatory system of the mussel, Mytilus edulis (L) Environ. Sci. Technol. 2008;42:5026–5031. doi: 10.1021/es800249a.\nvon Moos N., Burkhardt-Holm P., Kohler A. Uptake and effects of microplastics on cells and tissue of the blue mussel Mytilus edulis L. after an experimental exposure. Environ. Sci. Technol. 2012;46:11327–11335. doi: 10.1021/es302332w.\nWegner A., Besseling E., Foekema E.M., Kamermans P., Koelmans A.A. Effects of nanopolystyrene on the feeding behavior of the blue mussel (Mytilus edulis L.) Environ. Toxicol. Chem. 2012;31:2490–2497. doi: 10.1002/etc.1984.\nCole M., Lindeque P., Fileman E., Halsband C., Goodhead R., Moger J., Galloway T.S. Microplastic ingestion by zooplankton. Environ. Sci. Technol. 2013;47:6646–6655. doi: 10.1021/es400663f.\nRodriguez A., Rodriguez B., Nazaret Carrasco M. High prevalence of parental delivery of plastic debris in Cory’s shearwaters (Calonectris diomedea) Mar. Pollut. Bull. 2012;64:2219–2223. doi: 10.1016/j.marpolbul.2012.06.011.\nUgolini A., Ungherese G., Ciofini M., Lapucci A., Camaiti M. Microplastic debris in sandhoppers. Estuar. Coast. Shelf Sci. 2013;129:19–22. doi: 10.1016/j.ecss.2013.05.026.\nBrowne M.A., Niven S.J., Galloway T.S., Rowland S.J., Thompson R.C. Microplastic moves pollutants and additives to worms, reducing functions linked to health and biodiversity. Curr. Biol. 2013;23:2388–2392. doi: 10.1016/j.cub.2013.10.012.\nBrandts I., Teles M., Goncalves A.P., Barreto A., Franco-Martinez L., Tvarijonaviciute A., Martins M.A., Soares A., Tort L., Oliveira M. Effects of nanoplastics on Mytilus galloprovincialis after individual and combined exposure with carbamazepine. Sci. Total Environ. 2018;643:775–784. doi: 10.1016/j.scitotenv.2018.06.257.\nAvio C.G., Gorbi S., Milan M., Benedetti M., Fattorini D., d’Errico G., Pauletto M., Bargelloni L., Regoli F. Pollutants bioavailability and toxicological risk from microplastics to marine mussels. Environ. Pollut. 2015;198:211–222. doi: 10.1016/j.envpol.2014.12.021.\nCole M., Coppock R., Lindeque P.K., Altin D., Reed S., Pond D.W., Sorensen L., Galloway T.S., Booth A.M. Effects of Nylon Microplastic on Feeding, Lipid Accumulation, and Moulting in a Coldwater Copepod. Environ. Sci. Technol. 2019;53:7075–7082. doi: 10.1021/acs.est.9b01853.\nTallec K., Huvet A., Di Poi C., Gonzalez-Fernandez C., Lambert C., Petton B., Le Goic N., Berchel M., Soudant P., Paul-Pont I. Nanoplastics impaired oyster free living stages, gametes and embryos. Environ. Pollut. 2018;242:1226–1235. doi: 10.1016/j.envpol.2018.08.020.\nEnfrin M., Lee J., Gibert Y., Basheer F., Kong L., Dumee L.F. Release of hazardous nanoplastic contaminants due to microplastics fragmentation under shear stress forces. J. Hazard. Mater. 2020;384:121393. doi: 10.1016/j.jhazmat.2019.121393.\nLee W.S., Cho H.J., Kim E., Huh Y.H., Kim H.J., Kim B., Kang T., Lee J.S., Jeong J. Bioaccumulation of polystyrene nanoplastics and their effect on the toxicity of Au ions in zebrafish embryos. Nanoscale. 2019;11:3173–3185. doi: 10.1039/C8NR09321K.\nTrevisan R., Voy C., Chen S., Di Giulio R.T. Nanoplastics Decrease the Toxicity of a Complex PAH Mixture but Impair Mitochondrial Energy Production in Developing Zebrafish. Environ. Sci. Technol. 2019;53:8405–8415. doi: 10.1021/acs.est.9b02003.\nBrun N.R., van Hage P., Hunting E.R., Haramis A.G., Vink S.C., Vijver M.G., Schaaf M.J.M., Tudorache C. Polystyrene nanoplastics disrupt glucose metabolism and cortisol levels with a possible link to behavioural changes in larval zebrafish. Commun. Biol. 2019;2:382. doi: 10.1038/s42003-019-0629-6.\nBrun N.R., Koch B.E.V., Varela M., Peijnenburg W.J.G.M., Spaink H.P., Vijver M.G. Nanoparticles induce dermal and intestinal innate immune system responses in zebrafish embryos. Environ. Sci. Nano. 2018;5:904–916. doi: 10.1039/C8EN00002F.\nChen Q., Yin D., Jia Y., Schiwy S., Legradi J., Yang S., Hollert H. Enhanced uptake of BPA in the presence of nanoplastics can lead to neurotoxic effects in adult zebrafish. Sci. Total Environ. 2017;609:1312–1321. doi: 10.1016/j.scitotenv.2017.07.144.\nBergami E., Bocci E., Vannuccini M.L., Monopoli M., Salvati A., Dawson K.A., Corsi I. Nano-sized polystyrene affects feeding, behavior and physiology of brine shrimp Artemia franciscana larvae. Ecotoxicol. Environ. Saf. 2016;123:18–25. doi: 10.1016/j.ecoenv.2015.09.021.\nAndrady A.L. Microplastics in the marine environment. Mar. Pollut. Bull. 2011;62:1596–1605. doi: 10.1016/j.marpolbul.2011.05.030.\nBrowne M.A., Crump P., Niven S.J., Teuten E., Tonkin A., Galloway T., Thompson R. Accumulation of microplastic on shorelines woldwide: Sources and sinks. Environ. Sci. Technol. 2011;45:9175–9179. doi: 10.1021/es201811s.\nSaal F.S., Parmigiani S., Palanza P.L., Everett L.G., Ragaini R. The plastic world: Sources, amounts, ecological impacts and effects on development, reproduction, brain and behavior in aquatic and terrestrial animals and humans Introduction. Environ. Res. 2008;108:127–130. doi: 10.1016/j.envres.2008.03.008.\nLebreton L.C.M., van der Zwet J., Damsteeg J.W., Slat B., Andrady A., Reisser J. River plastic emissions to the world’s oceans. Nat. Commun. 2017;8:15611. doi: 10.1038/ncomms15611.\nMani T., Hauk A., Walter U., Burkhardt-Holm P. Microplastics profile along the Rhine River. Sci. Rep. 2015;5:17988. doi: 10.1038/srep17988.\nBarnes D.K., Galgani F., Thompson R.C., Barlaz M. Accumulation and fragmentation of plastic debris in global environments. Philos. Trans. R. Soc. Lond. B Biol. Sci. 2009;364:1985–1998. doi: 10.1098/rstb.2008.0205.\nBell J.D., Watson R.A., Ye Y. Global fishing capacity and fishing effort from 1950–2012 (vol 18, pg 489, 2017) Fish Fish. 2017;18:792–793. doi: 10.1111/faf.12187.\nWatson R.A., Cheung W.W.L., Anticamara J.A., Sumaila R.U., Zeller D., Pauly D. Global marine yield halved as fishing intensity redoubles. Fish Fish. 2013;14:493–503. doi: 10.1111/j.1467-2979.2012.00483.x.\nThompson R.C., Olsen Y., Mitchell R.P., Davis A., Rowland S.J., John A.W.G., McGonigle D., Russell A.E. Lost at sea: Where is all the plastic? Science. 2004;304:838. doi: 10.1126/science.1094559.\nAl-Oufi H., McLean E., Kumar A.S., Claereboudt M., Al-Habsi M. The effects of solar radiation upon breaking strength and elongation of fishing nets. Fish. Res. 2004;66:115–119. doi: 10.1016/S0165-7836(03)00103-6.\nThomas S.N., Hridayanathan C. The effect of natural sunlight on the strength of polyamide 6 multifilament and monofilament fishing net materials. Fish. Res. 2006;81:326–330. doi: 10.1016/j.fishres.2006.06.012.\nHinojosa I.A., Thiel M. Floating marine debris in fjords, gulfs and channels of southern Chile. Mar. Pollut. Bull. 2009;58:341–350. doi: 10.1016/j.marpolbul.2008.10.020.\nSheavly S.B., Register K.M. Marine debris & plastics: Environmental concerns, sources, impacts and solutions. J. Polym. Environ. 2007;15:301–305. doi: 10.1007/s10924-007-0074-3.\nDerraik J.G. The pollution of the marine environment by plastic debris: A review. Mar. Pollut. Bull. 2002;44:842–852. doi: 10.1016/S0025-326X(02)00220-5.\nCai L., Wang J., Peng J., Tan Z., Zhan Z., Tan X., Chen Q. Characteristic of microplastics in the atmospheric fallout from Dongguan city, China: Preliminary research and first evidence. Environ. Sci. Pollut. Res. Int. 2017;24:24928–24935. doi: 10.1007/s11356-017-0116-x.\nCole M., Lindeque P., Halsband C., Galloway T.S. Microplastics as contaminants in the marine environment: A review. Mar. Pollut. Bull. 2011;62:2588–2597. doi: 10.1016/j.marpolbul.2011.09.025.\nArias-Villamizar C.A., Vazquez-Morillas A. Degradation of Conventional and Oxodegradable High Density Polyethylene in Tropical Aqueous and Outdoor Environments. Rev. Int. Contam. Ambient. 2018;34:137–147. doi: 10.20937/RICA.2018.34.01.12.\nCooper D.A., Corcoran P.L. Effects of mechanical and chemical processes on the degradation of plastic beach debris on the island of Kauai, Hawaii. Mar. Pollut. Bull. 2010;60:650–654. doi: 10.1016/j.marpolbul.2009.12.026.\nVeiga J.M., Fleet D., Kinsey S., Nilsson P., Vlachogianni T., Werner S., Galgani F., Thompson R.C., Dagevos J., Gago J., et al.  Identifying Sources of Marine Litter. MSFD GES TG Marine Litter Thematic Report; JRC Technical Reports.  [(accessed on 21 February 2021)];2016  Available online:\nhttps://core.ac.uk/download/pdf/81685372.pdf\nChang M. Reducing microplastics from facial exfoliating cleansers in wastewater through treatment versus consumer product decisions. Mar. Pollut. Bull. 2015;101:330–333. doi: 10.1016/j.marpolbul.2015.10.074.\nFendall L.S., Sewell M.A. Contributing to marine pollution by washing your face: Microplastics in facial cleansers. Mar. Pollut. Bull. 2009;58:1225–1228. doi: 10.1016/j.marpolbul.2009.04.025.\nGregory M.R. Environmental implications of plastic debris in marine settings--entanglement, ingestion, smothering, hangers-on, hitch-hiking and alien invasions. Philos. Trans. R. Soc. Lond. B Biol. Sci. 2009;364:2013–2025. doi: 10.1098/rstb.2008.0265.\nLei K., Qiao F., Liu Q., Wei Z., Qi H., Cui S., Yue X., Deng Y., An L. Microplastics releasing from personal care and cosmetic products in China. Mar. Pollut. Bull. 2017;123:122–126. doi: 10.1016/j.marpolbul.2017.09.016.\nCastaneda R.A., Avlijas S., Simard M.A., Ricciardi A. Microplastic pollution in St. Lawrence River sediments. Can. J. Fish. Aquat. Sci. 2014;71:1767–1771. doi: 10.1139/cjfas-2014-0281.\nNapper I.E., Bakir A., Rowland S.J., Thompson R.C. Characterisation, quantity and sorptive properties of microplastics extracted from cosmetics. Mar. Pollut. Bull. 2015;99:178–185. doi: 10.1016/j.marpolbul.2015.07.029.\nCesa F.S., Turra A., Baruque-Ramos J. Synthetic fibers as microplastics in the marine environment: A review from textile perspective with a focus on domestic washings. Sci. Total Environ. 2017;598:1116–1129. doi: 10.1016/j.scitotenv.2017.04.172.\nFeldman D. Polymer weathering: Photo-oxidation. J. Polym. Environ. 2002;10:163–173. doi: 10.1023/A:1021148205366.\nWagner M., Scherer C., Alvarez-Munoz D., Brennholt N., Bourrain X., Buchinger S., Fries E., Grosbois C., Klasmeier J., Marti T., et al.  Microplastics in freshwater ecosystems: What we know and what we need to know. Environ. Sci. Eur. 2014;26:12. doi: 10.1186/s12302-014-0012-7.\nRosenkranz P., Chaudhry Q., Stone V., Fernandes T.F. A comparison of nanoparticle and fine particle uptake by Daphnia magna. Environ. Toxicol. Chem. 2009;28:2142–2149. doi: 10.1897/08-559.1.\nVelzeboer I., Kwadijk C.J., Koelmans A.A. Strong sorption of PCBs to nanoplastics, microplastics, carbon nanotubes, and fullerenes. Environ. Sci. Technol. 2014;48:4869–4876. doi: 10.1021/es405721v.\nEriksen M., Lebreton L.C., Carson H.S., Thiel M., Moore C.J., Borerro J.C., Galgani F., Ryan P.G., Reisser J. Plastic Pollution in the World’s Oceans: More than 5 Trillion Plastic Pieces Weighing over 250,000 Tons Afloat at Sea. PLoS ONE. 2014;9:e111913.  doi: 10.1371/journal.pone.0111913.\nGalgani F., Hanke G., Maes T.  Marine Anthropogenic Litter. Springer; Cham, Switzerland: 2015. Global Distribution, Composition and Abundance of Marine Litter; pp. 29–56.\nPeters C.A., Bratton S.P. Urbanization is a major influence on microplastic ingestion by sunfish in the Brazos River Basin, Central Texas, USA. Environ. Pollut. 2016;210:380–387. doi: 10.1016/j.envpol.2016.01.018.\nCozar A., Echevarria F., Gonzalez-Gordillo J.I., Irigoien X., Ubeda B., Hernandez-Leon S., Palma A.T., Navarro S., Garcia-de-Lomas J., Ruiz A., et al.  Plastic debris in the open ocean. Proc. Natl. Acad. Sci. USA. 2014;111:10239–10244. doi: 10.1073/pnas.1314705111.\nReisser J., Slat B., Noble K., du Plessis K., Epp M., Proietti M., de Sonneville J., Becker T., Pattiaratchi C. The vertical distribution of buoyant plastics at sea: An observational study in the North Atlantic Gyre. Biogeosciences. 2015;12:1249–1256. doi: 10.5194/bg-12-1249-2015.\nJambeck J.R., Geyer R., Wilcox C., Siegler T.R., Perryman M., Andrady A., Narayan R., Law K.L. Plastic waste inputs from land into the ocean. Science. 2015;347:768–771. doi: 10.1126/science.1260352.\nCourtene-Jones W., Quinn B., Gary S.F., Mogg A.O.M., Narayanaswamy B.E. Microplastic pollution identified in deep-sea water and ingested by benthic invertebrates in the rockall trough, north atlantic ocean. Environ. Pollut. :2017. doi: 10.1016/j.envpol.2017.08.026.\nPeng X., Chen M., Chen S., Dasgupta S., Xu H., Ta K., Du M., Li J., Guo Z., Bai S. Microplastics contaminate the deepest part of the world’s ocean. Geochem. Perspect. Lett. 2018:1–5. doi: 10.7185/geochemlet.1829.\nLambert S., Wagner M. Environmental performance of bio-based and biodegradable plastics: The road ahead. Chem. Soc. Rev. 2017;46:6855–6871. doi: 10.1039/C7CS00149E.\nLaw K.L., Moret-Ferguson S., Maximenko N.A., Proskurowski G., Peacock E.E., Hafner J., Reddy C.M. Plastic accumulation in the North Atlantic subtropical gyre. Science. 2010;329:1185–1188. doi: 10.1126/science.1192321.\nRummel C.D., Jahnke A., Gorokhova E., Kuhnel D., Schmitt-Jansen M. Impacts of Biofilm Formation on the Fate and Potential Effects of Microplastic in the Aquatic Environment. Environ. Sci. Technol. 2017;4:258–267. doi: 10.1021/acs.estlett.7b00164.\nWoodall L.C., Sanchez-Vidal A., Canals M., Paterson G.L.J., Coppock R., Sleight V., Calafat A., Rogers A.D., Narayanaswamy B.E., Thompson R.C. The deep sea is a major sink for microplastic debris. R. Soc. Open Sci. 2014;1 doi: 10.1098/rsos.140317.\nBesseling E., Foekema E.M., van den Heuvel-Greve M.J., Koelmans A.A. The Effect of Microplastic on the Uptake of Chemicals by the Lugworm Arenicola marina (L.) under Environmentally Relevant Exposure Conditions. Environ. Sci. Technol. 2017;51:8795–8804. doi: 10.1021/acs.est.7b02286.\nLong M., Paul-Pont I., Hegaret H., Moriceau B., Lambert C., Huvet A., Soudant P. Interactions between polystyrene microplastics and marine phytoplankton lead to species-specific hetero-aggregation. Environ. Pollut. 2017;228:454–463. doi: 10.1016/j.envpol.2017.05.047.\nZhang W.W., Zhang S.F., Wang J.Y., Wang Y., Mu J.L., Wang P., Lin X.Z., Ma D.Y. Microplastic pollution in the surface waters of the Bohai Sea, China. Environ. Pollut. 2017;231:541–548. doi: 10.1016/j.envpol.2017.08.058.\nKooi M., van Nes E.H., Scheffer M., Koelmans A.A. Ups and Downs in the Ocean: Effects of Biofouling on Vertical Transport of Microplastics. Environ. Sci. Technol. 2017;51:7963–7971. doi: 10.1021/acs.est.6b04702.\nTata T., Belabed B.E., Bououdina M., Bellucci S. Occurrence and characterization of surface sediment microplastics and litter from North African coasts of Mediterranean Sea: Preliminary research and first evidence. Sci. Total Environ. 2020;713:136664. doi: 10.1016/j.scitotenv.2020.136664.\nJiang Y., Yang F., Zhao Y., Wang J. Greenland Sea Gyre increases microplastic pollution in the surface waters of the Nordic Seas. Sci. Total Environ. 2020;712:136484. doi: 10.1016/j.scitotenv.2019.136484.\nSfriso A.A., Tomio Y., Rosso B., Gambaro A., Sfriso A., Corami F., Rastelli E., Corinaldesi C., Mistri M., Munari C. Microplastic accumulation in benthic invertebrates in Terra Nova Bay (Ross Sea, Antarctica) Environ. Int. 2020;137:105587. doi: 10.1016/j.envint.2020.105587.\nMehdinia A., Dehbandi R., Hamzehpour A., Rahnama R. Identification of microplastics in the sediments of southern coasts of the Caspian Sea, north of Iran. Environ. Pollut. 2020;258:113738. doi: 10.1016/j.envpol.2019.113738.\nFalahudin D., Cordova M.R., Sun X., Yogaswara D., Wulandari I., Hindarti D., Arifin Z. The first occurrence, spatial distribution and characteristics of microplastic particles in sediments from Banten Bay, Indonesia. Sci. Total Environ. 2020;705:135304. doi: 10.1016/j.scitotenv.2019.135304.\nMataji A., Taleshi M.S., Balimoghaddas E. Distribution and Characterization of Microplastics in Surface Waters and the Southern Caspian Sea Coasts Sediments. Arch. Environ. Contam. Toxicol. 2020;78:86–93. doi: 10.1007/s00244-019-00700-2.\nGomiero A., Oysaed K.B., Agustsson T., van Hoytema N., van Thiel T., Grati F. First record of characterization, concentration and distribution of microplastics in coastal sediments of an urban fjord in south west Norway using a thermal degradation method. Chemosphere. 2019;227:705–714. doi: 10.1016/j.chemosphere.2019.04.096.\nRose D., Webber M. Characterization of microplastics in the surface waters of Kingston Harbour. Sci. Total Environ. 2019;664:753–760. doi: 10.1016/j.scitotenv.2019.01.319.\nPan Z., Guo H.G., Chen H.Z., Wang S.M., Sun X.W., Zou Q.P., Zhang Y.B., Lin H., Cai S.Z., Huang J. Microplastics in the Northwestern Pacific: Abundance, distribution, and characteristics. Sci. Total Environ. 2019;650:1913–1922. doi: 10.1016/j.scitotenv.2018.09.244.\nLi J., Zhang H., Zhang K.N., Yang R.J., Li R.Z., Li Y.F. Characterization, source, and retention of microplastic in sandy beaches and mangrove wetlands of the Qinzhou Bay, China. Mar. Pollut. Bull. 2018;136:401–406. doi: 10.1016/j.marpolbul.2018.09.025.\nLusher A.L., Tirelli V., O’Connor I., Officer R. Microplastics in Arctic polar waters: The first reported values of particles in surface and sub-surface samples. Sci. Rep. 2015;5 doi: 10.1038/srep14947.\nDesforges J.P.W., Galbraith M., Dangerfield N., Ross P.S. Widespread distribution of microplastics in subsurface seawater in the NE Pacific Ocean. Mar. Pollut. Bull. 2014;79:94–99. doi: 10.1016/j.marpolbul.2013.12.035.\nAlimba C.G., Faggio C. Microplastics in the marine environment: Current trends in environmental pollution and mechanisms of toxicological profile. Environ. Toxicol. Pharmacol. 2019;68:61–74. doi: 10.1016/j.etap.2019.03.001.\nGuzzetti E., Sureda A., Tejada S., Faggio C. Microplastic in marine organism: Environmental and toxicological effects. Environ. Toxicol. Pharmacol. 2018;64:164–171. doi: 10.1016/j.etap.2018.10.009.\nSavoca S., Capillo G., Mancuso M., Bottari T., Crupi R., Branca C., Romano V., Faggio C., D’Angelo G., Spano N. Microplastics occurrence in the Tyrrhenian waters and in the gastrointestinal tract of two congener species of seabreams. Environ. Toxicol. Pharmacol. 2019;67:35–41. doi: 10.1016/j.etap.2019.01.011.\nSavoca S., Capillo G., Mancuso M., Faggio C., Panarello G., Crupi R., Bonsignore M., D’Urso L., Compagnini G., Neri F., et al.  Detection of artificial cellulose microfibers in Boops boops from the northern coasts of Sicily (Central Mediterranean) Sci. Total Environ. 2019;691:455–465. doi: 10.1016/j.scitotenv.2019.07.148.\nMao Y., Ai H., Chen Y., Zhang Z., Zeng P., Kang L., Li W., Gu W., He Q., Li H. Phytoplankton response to polystyrene microplastics: Perspective from an entire growth period. Chemosphere. 2018;208:59–68. doi: 10.1016/j.chemosphere.2018.05.170.\nSjollema S.B., Redondo-Hasselerharm P., Leslie H.A., Kraak M.H.S., Vethaak A.D. Do plastic particles affect microalgal photosynthesis and growth? Aquat. Toxicol. 2016;170:259–261. doi: 10.1016/j.aquatox.2015.12.002.\nBesseling E., Wegner A., Foekema E.M., van den Heuvel-Greve M.J., Koelmans A.A. Effects of Microplastic on Fitness and PCB Bioaccumulation by the Lugworm Arenicola marina (L.) Environ. Sci. Technol. 2013;47:593–600. doi: 10.1021/es302763x.\nLee K.W., Shim W.J., Kwon O.Y., Kang J.H. Size-dependent effects of micro polystyrene particles in the marine copepod Tigriopus japonicus. Environ. Sci. Technol. 2013;47:11278–11283. doi: 10.1021/es401932b.\nMessinetti S., Mercurio S., Parolini M., Sugni M., Pennati R. Effects of polystyrene microplastics on early stages of two marine invertebrates with different feeding strategies. Environ. Pollut. 2018;237:1080–1087. doi: 10.1016/j.envpol.2017.11.030.\nNobre C.R., Santana M.F.M., Maluf A., Cortez F.S., Cesar A., Pereira C.D.S., Turra A. Assessment of microplastic toxicity to embryonic development of the sea urchin Lytechinus variegatus (Echinodermata: Echinoidea) Mar. Pollut. Bull. 2015;92:99–104. doi: 10.1016/j.marpolbul.2014.12.050.\nBalbi T., Camisassi G., Montagna M., Fabbri R., Franzellitti S., Carbone C., Dawson K., Canesi L. Impact of cationic polystyrene nanoparticles (PS-NH(2)) on early embryo development of Mytilus galloprovincialis: Effects on shell formation. Chemosphere. 2017;186:1–9. doi: 10.1016/j.chemosphere.2017.07.120.\nMartinez-Gomez C., Leon V.M., Calles S., Gomariz-Olcina M., Vethaak A.D. The adverse effects of virgin microplastics on the fertilization and larval development of sea urchins. Mar. Environ. Res. 2017;130:69–76. doi: 10.1016/j.marenvres.2017.06.016.\nGandara E.S.P.P., Nobre C.R., Resaffe P., Pereira C.D.S., Gusmao F. Leachate from microplastics impairs larval development in brown mussels. Water Res. 2016;106:364–370. doi: 10.1016/j.watres.2016.10.016.\nSussarellu R., Suquet M., Thomas Y., Lambert C., Fabioux C., Pernet M.E.J., Le Goic N., Quillien V., Mingant C., Epelboin Y., et al.  Oyster reproduction is affected by exposure to polystyrene microplastics. Proc. Natl. Acad. Sci. USA. 2016;113:2430–2435. doi: 10.1073/pnas.1519019113.\nLu Y., Zhang Y., Deng Y., Jiang W., Zhao Y., Geng J., Ding L., Ren H. Uptake and Accumulation of Polystyrene Microplastics in Zebrafish (Danio rerio) and Toxic Effects in Liver. Environ. Sci. Technol. 2016;50:4054–4060. doi: 10.1021/acs.est.6b00183.\nYu P., Liu Z., Wu D., Chen M., Lv W., Zhao Y. Accumulation of polystyrene microplastics in juvenile Eriocheir sinensis and oxidative stress effects in the liver. Aquat. Toxicol. 2018;200:28–36. doi: 10.1016/j.aquatox.2018.04.015.\nHeindler F.M., Alajmi F., Huerlimann R., Zeng C., Newman S.J., Vamvounis G., van Herwerden L. Toxic effects of polyethylene terephthalate microparticles and Di(2-ethylhexyl)phthalate on the calanoid copepod, Parvocalanus crassirostris. Ecotoxicol. Environ. Saf. 2017;141:298–305. doi: 10.1016/j.ecoenv.2017.03.029.\nSnell T.W., Hicks D.G. Assessing Toxicity of Nanoparticles Using Brachionus manjavacas (Rotifera) Environ. Toxicol. 2011;26:146–152. doi: 10.1002/tox.20538.\nDella Torre C., Bergami E., Salvati A., Faleri C., Cirino P., Dawson K.A., Corsi I. Accumulation and Embryotoxicity of Polystyrene Nanoparticles at Early Stage of Development of Sea Urchin Embryos Paracentrotus lividus. Environ. Sci. Technol. 2014;48:12302–12311. doi: 10.1021/es502569w.\nPaul-Pont I., Lacroix C., Gonzalez Fernandez C., Hegaret H., Lambert C., Le Goic N., Frere L., Cassone A.L., Sussarellu R., Fabioux C., et al.  Exposure of marine mussels Mytilus spp. to polystyrene microplastics: Toxicity and influence on fluoranthene bioaccumulation. Environ. Pollut. 2016;216:724–737. doi: 10.1016/j.envpol.2016.06.039.\nGomiero A., Strafella P., Pellini G., Salvalaggio V., Fabi G. Comparative Effects of Ingested PVC Micro Particles With and Without Adsorbed Benzo(a)pyrene vs. Spiked Sediments on the Cellular and Sub Cellular Processes of the Benthic Organism Hediste diversicolor. Front. Mar. Sci. 2018;5 doi: 10.3389/fmars.2018.00099.\nSleight V.A., Bakir A., Thompson R.C., Henry T.B. Assessment of microplastic-sorbed contaminant bioavailability through analysis of biomarker gene expression in larval zebrafish. Mar. Pollut. Bull. 2017;116:291–297. doi: 10.1016/j.marpolbul.2016.12.055.\nOliveira M., Ribeiro A., Hylland K., Guilhermino L. Single and combined effects of microplastics and pyrene on juveniles (0+group) of the common goby Pomatoschistus microps (Teleostei, Gobiidae) Ecol. Indic. 2013;34:641–647. doi: 10.1016/j.ecolind.2013.06.019.\nMurray F., Cowie P.R. Plastic contamination in the decapod crustacean Nephrops norvegicus (Linnaeus, 1758) Mar. Pollut. Bull. 2011;62:1207–1217. doi: 10.1016/j.marpolbul.2011.03.032.\nScherer C., Brennholt N., Reifferscheid G., Wagner M. Feeding type and development drive the ingestion of microplastics by freshwater invertebrates. Sci. Rep. 2017;7 doi: 10.1038/s41598-017-17191-7.\nSetala O., Norkko J., Lehtiniemi M. Feeding type affects microplastic ingestion in a coastal invertebrate community. Mar. Pollut. Bull. 2016;102:95–101. doi: 10.1016/j.marpolbul.2015.11.053.\nSetala O., Fleming-Lehtinen V., Lehtiniemi M. Ingestion and transfer of microplastics in the planktonic food web. Environ. Pollut. 2014;185:77–83. doi: 10.1016/j.envpol.2013.10.013.\nWatts A.J.R., Lewis C., Goodhead R.M., Beckett S.J., Moger J., Tyler C.R., Galloway T.S. Uptake and Retention of Microplastics by the Shore Crab Carcinus maenas. Environ. Sci. Technol. 2014;48:8823–8830. doi: 10.1021/es501090e.\nRomeo T., Pietro B., Peda C., Consoli P., Andaloro F., Fossi M.C. First evidence of presence of plastic debris in stomach of large pelagic fish in the Mediterranean Sea. Mar. Pollut. Bull. 2015;95:358–361. doi: 10.1016/j.marpolbul.2015.04.048.\nLunov O., Syrovets T., Loos C., Beil J., Delacher M., Tron K., Nienhaus G.U., Musyanovych A., Mailander V., Landfester K., et al.  Differential uptake of functionalized polystyrene nanoparticles by human macrophages and a monocytic cell line. ACS Nano. 2011;5:1657–1669. doi: 10.1021/nn2000756.\nMazurais D., Ernande B., Quazuguel P., Severe A., Huelvan C., Madec L., Mouchel O., Soudant P., Robbens J., Huvet A., et al.  Evaluation of the impact of polyethylene microbeads ingestion in European sea bass (Dicentrarchus labrax) larvae. Mar. Environ. Res. 2015;112:78–85. doi: 10.1016/j.marenvres.2015.09.009.\nRolton A., Vignier J., Volety A.K., Pierce R.H., Henry M., Shumway S.E., Bricelj V.M., Hegaret H., Soudant P. Effects of field and laboratory exposure to the toxic dinoflagellate Karenia brevis on the reproduction of the eastern oyster, Crassostrea virginica, and subsequent development of offspring. Harmful Algae. 2016;57:13–26. doi: 10.1016/j.hal.2016.04.011.\nCollard F., Gilbert B., Compere P., Eppe G., Das K., Jauniaux T., Parmentier E. Microplastics in livers of European anchovies (Engraulis encrasicolus, L.) Environ. Pollut. 2017;229:1000–1005. doi: 10.1016/j.envpol.2017.07.089.\nKolandhasamy P., Su L., Li J., Qu X., Jabeen K., Shi H. Adherence of microplastics to soft tissue of mussels: A novel way to uptake microplastics beyond ingestion. Sci. Total Environ. 2018;610–611:635–640. doi: 10.1016/j.scitotenv.2017.08.053.\nCollignon A., Hecq J.H., Glagani F., Voisin P., Collard F., Goffart A. Neustonic microplastic and zooplankton in the North Western Mediterranean Sea. Mar. Pollut. Bull. 2012;64:861–864. doi: 10.1016/j.marpolbul.2012.01.011.\nWelden N.A., Abylkhani B., Howarth L.M. The effects of trophic transfer and environmental factors on microplastic uptake by plaice, Pleuronectes plastessa, and spider crab, Maja squinado. Environ. Pollut. 2018;239:351–358. doi: 10.1016/j.envpol.2018.03.110.\nWardrop P., Shimeta J., Nugegoda D., Morrison P.D., Miranda A., Tang M., Clarke B.O. Chemical Pollutants Sorbed to Ingested Microbeads from Personal Care Products Accumulate in Fish. Environ. Sci. Technol. 2016;50:4037–4044. doi: 10.1021/acs.est.5b06280.\nBottari T., Savoca S., Mancuso M., Capillo G., GiuseppePanarello G., MartinaBonsignore M., Crupi R., Sanfilippo M., D’Urso L., Compagnini G., et al.  Plastics occurrence in the gastrointestinal tract of Zeus faber and Lepidopus caudatus from the Tyrrhenian Sea. Mar. Pollut. Bull. 2019;146:408–416. doi: 10.1016/j.marpolbul.2019.07.003.\nCapillo G., Savoca S., Panarello G., Mancuso M., Branca C., Romano V., D’Angelo G., Bottari T., Spano N. Quali-quantitative analysis of plastics and synthetic microfibers found in demersal species from Southern Tyrrhenian Sea (Central Mediterranean) Mar. Pollut. Bull. 2020;150:110596. doi: 10.1016/j.marpolbul.2019.110596.\nBarboza L.G.A., Vieira L.R., Branco V., Carvalho C., Guilhermino L. Microplastics increase mercury bioconcentration in gills and bioaccumulation in the liver, and cause oxidative stress and damage in Dicentrarchus labrax juveniles. Sci. Rep. 2018;8:15655. doi: 10.1038/s41598-018-34125-z.\nOgonowski M., Schur C., Jarsen A., Gorokhova E. The Effects of Natural and Anthropogenic Microparticles on Individual Fitness in Daphnia magna. PLoS ONE. 2016;11 doi: 10.1371/journal.pone.0155063.\nWard J.E., Kach D.J. Marine aggregates facilitate ingestion of nanoparticles by suspension-feeding bivalves. Mar. Environ. Res. 2009;68:137–142. doi: 10.1016/j.marenvres.2009.05.002.\nRochman C.M., Hoh E., Kurobe T., Teh S.J. Ingested plastic transfers hazardous chemicals to fish and induces hepatic stress. Sci. Rep. 2013;3:3263. doi: 10.1038/srep03263.\nTeuten E.L., Saquing J.M., Knappe D.R., Barlaz M.A., Jonsson S., Bjorn A., Rowland S.J., Thompson R.C., Galloway T.S., Yamashita R., et al.  Transport and release of chemicals from plastics to the environment and to wildlife. Philos. Trans. R. Soc. Lond. B Biol. Sci. 2009;364:2027–2045. doi: 10.1098/rstb.2008.0284.\nWen B., Jin S.R., Chen Z.Z., Gao J.Z., Liu Y.N., Liu J.H., Feng X.S. Single and combined effects of microplastics and cadmium on the cadmium accumulation, antioxidant defence and innate immunity of the discus fish (Symphysodon aequifasciatus) Environ. Pollut. 2018;243:462–471. doi: 10.1016/j.envpol.2018.09.029.\nMa Y., Huang A., Cao S., Sun F., Wang L., Guo H., Ji R. Effects of nanoplastics and microplastics on toxicity, bioaccumulation, and environmental fate of phenanthrene in fresh water. Environ. Pollut. 2016;219:166–173. doi: 10.1016/j.envpol.2016.10.061.\nDiepens N.J., Koelmans A.A. Accumulation of Plastic Debris and Associated Contaminants in Aquatic Food Webs. Environ. Sci. Technol. 2018;52:8510–8520. doi: 10.1021/acs.est.8b02515.\nEerkes-Medrano D., Thompson R.C., Aldridge D.C. Microplastics in freshwater systems: A review of the emerging threats, identification of knowledge gaps and prioritisation of research needs. Water Res. 2015;75:63–82. doi: 10.1016/j.watres.2015.02.012.\nLusher A.L., Burke A., O’Connor I., Officer R. Microplastic pollution in the Northeast Atlantic Ocean: Validated and opportunistic sampling. Mar. Pollut. Bull. 2014;88:325–333. doi: 10.1016/j.marpolbul.2014.08.023.\nGonzalez-Fernandez C., Toullec J., Lambert C., Le Goic N., Seoane M., Moriceau B., Huvet A., Berchel M., Vincent D., Courcot L., et al.  Do transparent exopolymeric particles (TEP) affect the toxicity of nanoplastics on Chaetoceros neogracile? Environ. Pollut. 2019;250:873–882. doi: 10.1016/j.envpol.2019.04.093.\nJeong C.B., Kang H.M., Lee Y.H., Kim M.S., Lee J.S., Seo J.S., Wang M., Lee J.S. Nanoplastic Ingestion Enhances Toxicity of Persistent Organic Pollutants (POPs) in the Monogonont Rotifer Brachionus koreanus via Multixenobiotic Resistance (MXR) Disruption. Environ. Sci. Technol. 2018;52:11411–11418. doi: 10.1021/acs.est.8b03211.\nAlmeida M., Martins M.A., Soares A.M.V., Cuesta A., Oliveira M. Polystyrene nanoplastics alter the cytotoxicity of human pharmaceuticals on marine fish cell lines. Environ. Toxicol. Pharmacol. 2019;69:57–65. doi: 10.1016/j.etap.2019.03.019.\nOberbeckmann S., Kreikemeyer B., Labrenz M. Environmental Factors Support the Formation of Specific Bacterial Assemblages on Microplastics. Front. Microbiol. 2018;8 doi: 10.3389/fmicb.2017.02709.\nDebroas D., Mone A., Ter Halle A. Plastics in the North Atlantic garbage patch: A boat-microbe for hitchhikers and plastic degraders. Sci. Total Environ. 2017;599:1222–1232. doi: 10.1016/j.scitotenv.2017.05.059.\nDussud C., Hudec C., George M., Fabre P., Higgs P., Bruzaud S., Delort A.M., Eyheraguibel B., Meistertzheim A.L., Jacquin J., et al.  Colonization of Non-biodegradable and Biodegradable Plastics by Marine Microorganisms. Front. Microbiol. 2018;9:1571. doi: 10.3389/fmicb.2018.01571.\nZettler E.R., Mincer T.J., Amaral-Zettler L.A. Life in the “Plastisphere”: Microbial Communities on Plastic Marine Debris. Environ. Sci. Technol. 2013;47:7137–7146. doi: 10.1021/es401288x.\nMcCormick A., Hoellein T.J., Mason S.A., Schluep J., Kelly J.J. Microplastic is an Abundant and Distinct Microbial Habitat in an Urban River. Environ. Sci. Technol. 2014;48:11863–11871. doi: 10.1021/es503610r.\nOberbeckmann S., Loeder M.G.J., Gerdts G., Osborn A.M. Spatial and seasonal variation in diversity and structure of microbial biofilms on marine plastics in Northern European waters. FEMS Microbiol. Ecol. 2014;90:478–492. doi: 10.1111/1574-6941.12409.\nReisser J., Shaw J., Hallegraeff G., Proietti M., Barnes D.K.A., Thums M., Wilcox C., Hardesty B.D., Pattiaratchi C. Millimeter-Sized Marine Plastics: A New Pelagic Habitat for Microorganisms and Invertebrates. PLoS ONE. 2014;9 doi: 10.1371/journal.pone.0100289.\nAmaral-Zettler L.A., Zettler E.R., Slikas B., Boyd G.D., Melvin D.W., Morrall C.E., Proskurowski G., Mincer T.J. The biogeography of the Plastisphere: Implications for policy. Front. Ecol. Environ. 2015;13:541–546. doi: 10.1890/150017.\nWebb H.K., Crawford R.J., Sawabe T., Ivanova E.P. Poly(ethylene terephthalate) Polymer Surfaces as a Substrate for Bacterial Attachment and Biofilm Formation. Microbes Environ. 2009;24:39–42. doi: 10.1264/jsme2.ME08538.\nMuthukumar T., Aravinthan A., Lakshmi K., Venkatesan R., Vedaprakash L., Doble M. Fouling and stability of polymers and composites in marine environment. Int. Biodeter. Biodegr. 2011;65:276–284. doi: 10.1016/j.ibiod.2010.11.012.\nShah A.A., Hasan F., Hameed A., Ahmed S. Biological degradation of plastics: A comprehensive review. Biotechnol. Adv. 2008;26:246–265. doi: 10.1016/j.biotechadv.2007.12.005.\nNegoro S. Biodegradation of nylon oligomers. Appl. Microbiol. Biotechnol. 2000;54:461–466. doi: 10.1007/s002530000434.\nYang Y., Yang J., Wu W.-M., Zhao J., Song Y., Gao L., Yang R., Jiang L. Biodegradation and Mineralization of Polystyrene by Plastic-Eating Mealworms: Part 1. Chemical and Physical Characterization and Isotopic Tests. Environ. Sci. Technol. 2015;49:12080–12086. doi: 10.1021/acs.est.5b02661.\nYang Y., Yang J., Wu W.M., Zhao J., Song Y., Gao L., Yang R., Jiang L. Biodegradation and Mineralization of Polystyrene by Plastic-Eating Mealworms: Part 2. Role of Gut Microorganisms. Environ. Sci. Technol. 2015;49:12087–12093. doi: 10.1021/acs.est.5b02663.\nYang J., Yang Y., Wu W.M., Zhao J., Jiang L. Evidence of polyethylene biodegradation by bacterial strains from the guts of plastic-eating waxworms. Environ. Sci. Technol. 2014;48:13776–13784. doi: 10.1021/es504038a.\nBalasubramanian V., Natarajan K., Hemambika B., Ramesh N., Sumathi C.S., Kottaimuthu R., Rajesh Kannan V. High-density polyethylene (HDPE)-degrading potential bacteria from marine ecosystem of Gulf of Mannar, India. Lett. Appl. Microbiol. 2010;51:205–211. doi: 10.1111/j.1472-765X.2010.02883.x.\nNakajima-Kambe T., Onuma F., Kimpara N., Nakahara T. Isolation and characterization of a bacterium which utilizes polyester polyurethane as a sole carbon and nitrogen source. FEMS Microbiol. Lett. 1995;129:39–42. doi: 10.1111/j.1574-6968.1995.tb07554.x.\nNakajima-Kambe T., Onuma F., Kimpara N., Nakahara T. Determination of the polyester polyurethane breakdown products and distribution of the polyurethane degrading enzyme of Comamonas acidovorans, strain TB-35. J. Food Sci. Technol. 1997;83:456–460. doi: 10.1016/S0922-338X(97)83000-0.\nPeng Y.H., Shih Y.H., Lai Y.C., Liu Y.Z., Liu Y.T., Lin N.C. Degradation of polyurethane by bacterium isolated from soil and assessment of polyurethanolytic activity of a Pseudomonas putida strain. Environ. Sci. Pollut. Res. Int. 2014;21:9529–9537. doi: 10.1007/s11356-014-2647-8.\nPeng R.T., Qin L.F., Yang Y. Biodegradation of polyurethane by the spacecraft-inhabiting bacterium [C] China Soc. Biotechnol. Young Sci. F. 2018:9. doi: 10.13345/j.cjb.170532.\nDe Tender C.A., Devriese L.I., Haegeman A., Maes S., Ruttink T., Dawyndt P. Bacterial Community Profiling of Plastic Litter in the Belgian Part of the North Sea. Environ. Sci. Technol. 2015;49:9629–9638. doi: 10.1021/acs.est.5b01093.\nKlaeger F., Tagg A.S., Otto S., Biemuller M., Sartorius I., Labrenz M. Residual Monomer Content Affects the Interpretation of Plastic Degradation. Sci. Rep. 2019;9 doi: 10.1038/s41598-019-38685-6.\nHarrison J.P., Boardman C., O’Callaghan K., Delort A.M., Song J. Biodegradability standards for carrier bags and plastic films in aquatic environments: A critical review. R. Soc. Open Sci. 2018;5:171792. doi: 10.1098/rsos.171792.",
  "authors": [],
  "journal": "Toxics",
  "date": "2021 Feb 22",
  "keywords": []
}