{
  "url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6471892/",
  "domain": "www.ncbi.nlm.nih.gov",
  "title": "Student motivation to learn: is self-belief the key to transition and first year performance in an undergraduate health professions program?",
  "abstract": "Abstract Background Student motivation to learn has been undervalued to date though has been identified as an area influencing student success and retention at university. The transition into university has been highlighted as a key period affecting student outcomes as well as well-being. Early identification of those students at risk may assist the transition for many students moving into higher education. Previous research has identified the Motivation and Engagement Scale – University/College (MES-UC) as a valid instrument for measuring motivation to learn in physiotherapy students. The aim of this study was to determine the relationship between a student’s motivation to learn on entry into an undergraduate physiotherapy program and their performance through first year. The relationship of admissions scores, to motivation to learn on entry, were also considered, to determine any link between these measures. Methods An observational longitudinal study was conducted on one cohort of undergraduate physiotherapy students commencing their studies in 2015 with a response rate of 67%. Correlations were performed between admission variables and Year 1 MES-UC scoring; and between Year 1 MES-UC scoring and subsequent academic performance across first year, taking into consideration gender and age. Results Self-belief was identified as the key dimension of motivation influencing student success in the transition into university. Results identified the link between self-belief scores on entry and academic performance in first year, including grade point average and performance in six of nine courses. Courses where there was no significant relationship were identified as curriculum areas where students may be less motivated. There was a relationship between the admissions interview and MES-UC scoring, demonstrating a link between non-cognitive selection measures and student motivation to learn on entry into the program. Conclusion Motivation to learn and specifically self-belief with learning, may be influential in the transition into higher education. Undertaking measures of academic motivation may be useful to determine student engagement with curriculum, through identifying any link between student self-belief and performance in specific courses. Changes to curriculum based on student motivation as well as targeting early those students with reduced self-belief may improve student success, psychosocial wellbeing and retention. Keywords: Motivation to learn, Admissions, Transition, Higher education, Self-belief, Curriculum",
  "content": ". 2019 Apr 18;19:111. doi:\n10.1186/s12909-019-1539-5\nStudent motivation to learn: is self-belief the key to transition and first year performance in an undergraduate health professions program?\nSchool of Physiotherapy, The University of Notre Dame Australia, 19 Mouat St, Fremantle, Western Australia 6959 Australia\nFaculty of Health and Medical Sciences, The University of Western Australia, 35 Stirling Hwy, Nedlands, Western Australia 6009 Australia\nSchool of Physiotherapy, The University of Notre Dame Australia, 19 Mouat St, Fremantle, Western Australia 6959 Australia\nFaculty of Health and Medical Sciences, The University of Western Australia, 35 Stirling Hwy, Nedlands, Western Australia 6009 Australia\nCopyright and License information\nSchool of Physiotherapy, The University of Notre Dame Australia, 19 Mouat St, Fremantle, Western Australia 6959 Australia\nFaculty of Health and Medical Sciences, The University of Western Australia, 35 Stirling Hwy, Nedlands, Western Australia 6009 Australia\nCorresponding author.\nReceived 2018 Aug 21; Accepted 2019 Apr 1; Collection date 2019.\n© The Author(s). 2019\nThis article is distributed under the terms of the Creative Commons Attribution 4.0 International License (\nhttp://creativecommons.org/licenses/by/4.0/\n), which permits unrestricted use, distribution, and reproduction in any medium, provided you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons license, and indicate if changes were made. The Creative Commons Public Domain Dedication waiver (\nhttp://creativecommons.org/publicdomain/zero/1.0/\n) applies to the data made available in this article, unless otherwise stated.\nPMCID: PMC6471892  PMID:\nStudent motivation to learn has been undervalued to date though has been identified as an area influencing student success and retention at university. The transition into university has been highlighted as a key period affecting student outcomes as well as well-being. Early identification of those students at risk may assist the transition for many students moving into higher education. Previous research has identified the Motivation and Engagement Scale – University/College (MES-UC) as a valid instrument for measuring motivation to learn in physiotherapy students. The aim of this study was to determine the relationship between a student’s motivation to learn on entry into an undergraduate physiotherapy program and their performance through first year. The relationship of admissions scores, to motivation to learn on entry, were also considered, to determine any link between these measures.\nAn observational longitudinal study was conducted on one cohort of undergraduate physiotherapy students commencing their studies in 2015 with a response rate of 67%. Correlations were performed between admission variables and Year 1 MES-UC scoring; and between Year 1 MES-UC scoring and subsequent academic performance across first year, taking into consideration gender and age.\nSelf-belief was identified as the key dimension of motivation influencing student success in the transition into university. Results identified the link between self-belief scores on entry and academic performance in first year, including grade point average and performance in six of nine courses. Courses where there was no significant relationship were identified as curriculum areas where students may be less motivated. There was a relationship between the admissions interview and MES-UC scoring, demonstrating a link between non-cognitive selection measures and student motivation to learn on entry into the program.\nMotivation to learn and specifically self-belief with learning, may be influential in the transition into higher education. Undertaking measures of academic motivation may be useful to determine student engagement with curriculum, through identifying any link between student self-belief and performance in specific courses. Changes to curriculum based on student motivation as well as targeting early those students with reduced self-belief may improve student success, psychosocial wellbeing and retention.\nMotivation to learn, Admissions, Transition, Higher education, Self-belief, Curriculum\nThere is an increasing focus on identifying factors that improve student retention at university. Completion rates and direct measures of student satisfaction and engagement have been identified as possible indicators for future performance funding in Australian higher education [\n]. A review of student dropout and completion in higher education in Europe identified study success as an important issue for future policy development [\n]. It was noted that research into study success impacting on completion rates and retention was limited. In a study reviewing the reasons for students leaving higher education [\n], three broad factors were identified as affecting student retention: learner characteristics including motivation and cognitive abilities; external factors including the current job market and family commitments; and institutional factors including teaching quality and interactions with peers and staff. In a review of high achieving medical students’ thoughts on key factors influencing their success, four key areas were identified: motivation; learning strategies; resource management and dealing with non-academic external problems [\n]. Motivation has been identified as an important contributor to student success as well as influential in determining student retention in higher education.\nFrom a psycho-educational perspective, ‘motivation to learn’ has been described as a student’s ‘energy and drive to learn, work effectively and achieve to their potential’, in addition to the behaviours associated with this energy and drive [\n] highlighted that higher education curriculum to date has been guided predominantly by cognitive approaches rather than by motivation theory, concluding that motivation to learn has been undervalued thus far. In the Association for Medical Education in Europe (AMEE) guide ‘Motivation in medical education’ [\n], it is noted that motivation is under-researched in the health sciences due to the assumption that students who enter professional courses such as medicine are highly motivated. Placing importance on ‘why’ students learn as well as ‘what’ and ‘how’, may guide educators in their teaching approaches and ultimately influence student outcomes including retention.\nMultiple theories as well as dimensions or factors of motivation have been presented in the literature [\n]. Cook and Artino’s review [\n] recommended additional research on academic motivation specific to health professions education and enhanced transparency with researchers identifying the ‘lens’ of motivation they are investigating, to improve clarity, application and replication. The lens or conceptual approach that has been adopted for this research is the model of academic motivation developed by Martin and represented in the Motivation and Engagement Wheel [\n]. The Motivation and Engagement Wheel [\n] is a framework representative of positive and negative motivation and engagement dimensions. Positive motivation or cognitive dimensions include self-belief, valuing and learning focus. Pajares [\n] noted that a person’s efficacy beliefs are linked to their effort, perseverance and resilience when completing tasks. These behavioural outcomes are also present in the adaptive behavioural dimensions of the Motivation and Engagement Wheel represented by Task Management, Planning and Persistence. Negative motivation dimensions include anxiety, failure avoidance and uncertain control. Negative engagement dimensions include self-sabotage and disengagement. The Motivation and Engagement Wheel and associated scales are supported by contemporary motivation theories [\n], resulting in a broad, comprehensive instrument.\nMartin designed a suite of Motivation and Engagement Scales (MES) based on the Motivation and Engagement Wheel, for respondents to contextualise to their current academic or work situation. The scales demonstrated equal validity across different domains from school to university and into the workplace [\n]. The Motivation and Engagement Scale – University/College (MES-UC) has been validated for the university student population and has been found to be reliable (Cronbach’s alpha 0.78) in research conducted on undergraduate students from two Australian universities [\n]. Research undertaken with the MES-UC has predominantly been conducted in the last five years with an increasing focus by researchers on utilising the instrument to both measure learner motivation and predict subsequent achievement.\nResearch to date has shown links between aspects of motivation as measured by the MES-UC and student typologies, adaptability and performance in their first year of university [\n]. In a recent study focusing on the behavioural or engagement factors from the MES-UC, a relationship was seen between negative engagement in first year university students and lower semester one Grade-Point Average (GPA) for 186 undergraduate psychology students [\n]. Similarly, Wurf and Croft-Piggin [\n] studied the influence of MES-UC scoring early in course on first year achievement, alongside academic score on entry (via the Australian Tertiary Admission Rank or ATAR) and emotional intelligence. The MES-UC, applied at week four following commencement, was the most powerful predictor of academic achievement, greater than ATAR on entry, and accounting for 21% of the variance in the regression model. Transition into higher education, particularly post-secondary education transition, has been identified as a period of significant psychosocial adjustment with research to date acknowledging the psychological, cognitive and affective changes that student’s experience [\n]. Exploring how motivation to learn impacts on the first year of higher education is key to understanding the contribution of motivation to student transition, achievement and retention.\nA preliminary proxy longitudinal study was conducted to review physiotherapy students’ motivation to learn, as measured by the MES-UC [\n]. This study provided the first data identifying mean values for motivation dimensions for health professional students using the MES-UC. Results demonstrated the validity of the MES-UC instrument in measuring motivation and determining differences between demographic and year groups. The results, taken from 233 students, representing 82% of Physiotherapy students enrolled in a Western Australian program, identified some concerning issues including higher levels of anxiety in female students compared to males across all year groups. Disengagement from studies was also noted as a concern for male first year students, highlighting the need to investigate motivation to learn as a standalone factor influencing transition and subsequent first year performance.\nThe aim of this study was to determine the relationship between a student’s motivation to learn on entry into an undergraduate physiotherapy program and their progress and performance through first year, taking into consideration gender and age. The relationship of co-variables, including admissions scores and educational background, to motivation to learn on entry, were also considered.\nSpecifically, the following research questions were addressed:\nWhat is the relationship between educational score on entry, background (school leaver versus mature age), admissions interview score and a student’s motivation to learn on entry into an undergraduate physiotherapy program, as determined by the MES-UC?\nWhat is the relationship between a student’s motivation to learn on entry, as determined by the MES-UC, and subsequent first year performance? Which dimensions of motivation, as measured by the MES-UC, may enhance or negatively impact academic performance in the first year of a physiotherapy program?\nUnderstanding the individual motivation dimensions that may influence learning and implementing appropriate interventions may improve both student motivation to learn and retention rates. Further, lower motivation levels have been associated with increased distress in medical students [\n]. Facilitating improved student motivation to learn may have the added role of enhancing student wellbeing. Early identification of those students at risk may assist the transition for many students moving from secondary to higher education. Lessons learned from this study will benefit localised translation into practice, informing other institutions looking to utilise outcomes measures to identify factors influencing student success and retention.\nPopulation and recruitment\nThis research is part of an observational longitudinal study with one cohort of undergraduate physiotherapy students from a Western Australian university, surveyed on entry into the four-year program in 2015. The cohort were subsequently surveyed every year until program completion in 2018. Participants in this study were recruited at the end of a teaching activity in week three of semester one in 2015, allowing maximal separation from assessment items to minimise any influence of assessment stress.\nThe researcher distributed hard copy participant information sheets, consent forms and surveys to students and invited them to drop their completed or non-completed surveys in a collection box at the rear of the lecture theatre following teaching activities. Students who consented to participate recorded their student number as an identifier as well as year level, age and sex. There was no incentive to participate and the researcher did not play any role in the assessment of the student cohort.\nConsent to add admissions data, including educational and interview scores, to the study was sought retrospectively, as admissions scores were later deemed to be pertinent co-variables to consider. The educational score on entry is calculated from either an applicant’s ATAR, for school leavers, or their GPA of previous undergraduate studies, for mature age applicants. The interview score is calculated from performance at a semi-structured admissions interview, with questioning including aspects of an applicant’s motivation to study physiotherapy. It is an integral component within the selection process, accounting for 40% of overall admissions scoring, once applicants pass initial academic screening. Individual consent was sought for the addition of admissions data from students still enrolled in the university with a waiver of consent approved for students no longer enrolled (\n= 7). Six students did not provide consent for the addition of admissions data. Data were sourced from existing admissions spreadsheets at the School of Physiotherapy.\nThe MES-UC is a 44-item instrument incorporating 11 dimensions of motivation, each represented by four items in the instrument, rated on a scale of 1 (strongly disagree) to 7 (strongly agree). The 11 motivation scores are grouped into four global domains. ‘Global booster thoughts’ includes scoring for self-belief, valuing and learning focus items. ‘Global booster behaviours’ includes planning, task management and persistence item scoring. For each global booster score and its individual dimensions, higher scores are more ideal. ‘Global mufflers’ represents scoring for the anxiety, failure avoidance and uncertain control items. ‘Global guzzlers’ includes item scoring from self-sabotage and disengagement dimensions. For ‘global mufflers’, ‘global guzzlers’ and their individual dimensions, lower scores are more ideal. Each of the 11 dimensions within the scale convert to a raw score out of 100.\nMES-UC survey results were collated in Microsoft® Excel before being transferred to IBM SPSS® Statistics Version 24.0 for analysis, with recording of all 44 items, 11 first order motivation dimensions, as well as scoring for each of the four higher order domains, per student. Admissions data including educational score on entry, interview score and background (school leaver/mature age) were also collated. The educational score was calculated by the School of Physiotherapy based on either a student’s predicted ATAR for school leavers, or a student’s previous undergraduate performance in a partially completed or completed undergraduate program for mature age students. A predicted ATAR score was calculated for each school leaver applicant by the university admissions office based on subjects studied and academic performance in the previous three semesters of school work. School leavers with a predicted ATAR of 94 or greater scored 40 out of 40, decreasing to 10 out of 40 for students scoring 85 or below. Mature age applicants who completed an undergraduate degree in a related field with a distinction/high distinction average scored 40 out of 40, decreasing to 10 out of 40 for those students having completed less than one year with a credit average. Academic results were also collated including the overall mark for every course of study undertaken and semester and year level Grade Point Average (GPA). Scatterplots were created to explore the linearity of data. The educational score was the only variable determined to not be linear in nature, due to clusters of data at extremes.\nDescriptive statistics were undertaken to determine the mean, standard deviation (SD) and range of age on entry, as well as proportions of sex and background for the 2015 cohort. The mean, SD and range of admissions variables were also determined with a comparison of means conducted with a one-way ANOVA per gender and background.\nBivariate correlations were performed between the admission variables of educational score and interview score and Year 1 MES-UC scoring; and between Year 1 MES-UC scoring and subsequent performance in the program, as determined by course marks in academic units and semester and year level GPA. Spearman’s rank correlation coefficients were calculated for the educational score versus outcome variables; Pearson correlation coefficients were performed for the interview score versus outcome variables; and Point biserial correlation coefficients were calculated for the dichotomous variable background and outcome variables. A univariate analysis of variance was performed adopting a general linear model, to determine the effect of variables including each motivation factor, on subsequent performance, controlling for the variables of age and gender. Significant findings were determined by a\n-value of less than 0.05.\nThe sample population entering first year in 2015 included 83 students, 51 (61.45%) female with an age range of 17 to 52 years (mean 19.87; SD 4.71) on entry. The cohort comprised 49 (59.04%) school leavers, with 34 (40.96%) mature age students having completed part or all a previous undergraduate degree program. Fifty-five first year physiotherapy students completed the survey representing 67% of the starting cohort with 33 (60%) females and 32 (58.18%) school leavers. The mean age was 19.91 (SD 5.32) with an age range of 17–52 years. The sample of participants were representative of the broader population of students in first year of the program.\nAdmissions scores and motivation to learn\nThe mean educational score on entry was 32.31 (SD: 5.40) with scores ranging from 10 to 40. Females (mean: 33.48; SD: 4.17) scored higher than males (mean: 30.53; SD: 6.58) though this was not significant (\n= 0.062). Interview scores for the cohort ranged from 20.5 to 40 (mean: 32.36; SD: 4.28). Males (mean: 33.92; SD: 4.12) scored significantly higher than females (mean: 31.30; SD: 4.11), (\nshows the relationships between admissions scores on entry and dimensions and global scores of the MES-UC as completed by students in week three of first semester. There was a significant correlation between educational score and student disengagement (\n= 0.033). The interview score correlated with scoring in three of the four global scores as well as three individual dimensions, with a further four dimensions trending towards significance. There was a negative relationship between interview score and student disengagement (\n= 0.005). School leavers scored significantly higher, comparative to mature age students, in the dimensions of uncertain control (\n= 0.008) and self-sabotage (\nCorrelation coefficients for admissions scores and background versus MES-UC dimension and global scores, for the 2015 cohort\nGlobal booster thoughts\nGlobal booster behaviours\nMotivation to learn and student performance in first year\nMean motivation scores and standard deviations for the cohort and per sex are presented in Table\n. Anxiety and task management were the only dimensions on the MES-UC to show a difference between genders, with females scoring significantly higher in both. When determining differences between backgrounds, two motivation dimensions had significant differences. School leavers scored higher for uncertain control (mean: 48.56; SD: 16.10) compared to mature age students (mean: 37.61; SD: 12.31;\n= 0.008). Self-sabotage was also higher in school leavers (mean: 31.16; SD: 13.56) compared to mature age students (mean: 24.39; SD: 8.98;\nMean motivation scores (and Standard Deviations) overall and per gender\nMean scores for males (SD)\nMean scores for females (SD)\nGlobal booster thoughts\nGlobal booster behaviours\nThe mean first year GPA for the cohort was 2.29 (SD: 0.72) with no significant difference between male students (2.39; SD: 0.71) and female students (2.21; SD: 0.73;\n= 0.368). Mature age students (mean: 2.56; SD: 0.76) had a higher first year GPA compared to school leavers (mean: 2.10; SD: 0.64) and this was significant (\nThe results of the univariate analysis of variance are presented in Table\nshowing the effect of variables including each motivation factor and global score, on first year GPA, controlling for the other variables. Self-belief was the only motivation dimension to have a significant effect on first year GPA (\n= 0.014). The effect of self-belief, controlling for gender and age, on all aspects of academic performance in first year, are presented in Table\n. There was a significant relationship between self-belief scoring on entry and academic performance in three out of four first semester courses and three out of five second semester courses.\nUnivariate analysis of variance results showing the effect of the 11 motivation dimensions of the MES-UC and global scores, controlling for age and gender, on first year GPA\nGlobal booster thoughts\nGlobal booster behaviours\nUnivariate analysis of variance results showing the effect of student self-belief, controlling for age and gender, on all first-year courses and semester GPA\nFirst year Physiotherapy courses\nFoundations of Physiotherapy Practice\nMolecular and Cell Biology\nAnatomy and Physiology of Body Systems\nMovement Sciences for Physiotherapy\nIntroduction to Philosophy\nSoft Tissue Injury Management\nSix students exited the course by the end of first year. A comparison of means between those students who stayed and exited the program revealed no significant differences in their motivation dimensions on entry into the program.\nThe first aim of this research was to determine the relationship between students’ background and educational and interview scores on entry, and their motivation to learn as measured by the MES-UC in week three of the physiotherapy program. Of note, for this sample, there was no relationship between academic entry scores and scoring on the MES-UC, with the exception of scoring for the disengagement dimension where there was a positive relationship between academic entry scores and disengagement from learning. Given the small sample size, this may be a chance finding although disengagement from learning in first year students was also previously noted in study of a larger sample of physiotherapy students from the same university [\n]. The authors postulate that the transition into the higher education learning environment as well as possible alternate aspirations for some high achieving students, including progression into the medical program, may be possible explanations for this finding.\nThe admissions interview correlated with three of four global scores including a positive relationship with booster thoughts and behaviours and a negative relationship with disengagement and the global behavioural score representing ‘guzzlers’. Applicants selected for interview have undertaken academic screening and have reached a threshold of academic performance deemed appropriate to complete academic tasks within the physiotherapy program. Thus, students enter with similar academic capabilities. Differentiating students that may be more motivated to learn and progress through the program, is much more difficult to determine on entry but the link between admissions interview and MES-UC does confirm that for this sample, the interview may be targeting alternate factors outside of cognitive ability. Previous research has shown a relationship between the admissions interview for this program and performance in clinical placements in Years 2–4, stronger than academic scores on entry [\n]. Determining any link between academic motivation and performance though the program, including clinical performance, may be useful to determine the value of monitoring student motivation in future cohorts. Monitoring of students was highlighted as a key institutional activity to improve study success, in a report into student dropout and completion in higher education in Europe [\nThe second aim of the study was to determine any relationships between the dimensions of academic motivation and student performance, taking into consideration gender and age. Although gender differences in achievement at university have previously been identified in the literature [\n], anxiety and task management were the only motivation dimensions to show any significant gender differences, with females scoring higher in both areas. Of note there was no link between either of these motivation dimensions and student performance so although they may have affected motivation to learn, they did not influence subsequent outcomes in first year. Anxiety towards learning may bring about enhanced task management to avoid failure [\n], thus the two dimensions may have worked together to ensure satisfactory academic outcomes.\nSignificant relationships were found between self-belief and results in three out of four semester one courses and three out of five semester two courses. There was no relationship between the other 10 motivation factors and student performance. Self-belief, as represented on the MES-UC, denotes a ‘students’ belief and confidence in their ability to understand or to do well in their university/college studies, to meet challenges they face, and to perform to the best of their ability’ [\n]. This definition of self-belief is congruous with ‘self-efficacy’, where students make cognitive judgements of their capabilities [\n] further termed self-efficacy in the academic context as ‘academic self-efficacy’, referring to a student’s confidence in their ability to complete a particular learning activity or task. Motivation to learn and self-efficacy have an integrated or co-dependent relationship as determined by contemporary motivation theories. In the expectancy value theory of motivation, individuals are more likely to engage in tasks where they have higher self-efficacy or belief about their actions and the likely outcomes that will follow [\n]. In Bandura’s social cognitive theory [\n], the perceived importance of the task is central to motivation with self-efficacy underpinning a person’s beliefs about their personal competence. Pajares [\n] noted that a person’s efficacy beliefs are linked to their effort, perseverance and resilience when completing tasks and further highlighted the link between self-efficacy and emotional reactions with decreased self-efficacy leading to stress, depression and/or reduced problem-solving abilities. Likewise, Zajacova et al. [\n] found academic self-efficacy and stress to be negatively correlated. Thus, tapping into a student’s self-efficacy or self-belief may be the key to both improving performance and decreasing stress. Targeting students with lowered self-belief on entry into higher education and providing appropriate intervention, may result in improved student outcomes including retention.\nIt is important for universities to understand how student self-efficacy interacts with institutional characteristics as this may ultimately influence retention rates. Self-belief scoring was linked to performance in certain first year courses comparative to other courses. Two out of three of the courses where there was no link between self-belief scoring and student performance, were not delivered by the physiotherapy program, with the third course since undergoing substantial changes due to student feedback on curriculum provided through traditional course review processes. This may indicate that measuring academic motivation may be useful to assist curriculum review and feedback. Curriculum development based on motivation theory needs further investigation though Turner [\n] identified the role of developing experiences through the higher education journey based around control, success and improvement, to foster self-belief in students.\nThe initial transition into university has been highlighted as a key period to provide intervention, with a review of Australian higher education students from eight institutions, undertaken mid-year, revealing that just over a third of first year students reported having difficulty getting motivated to study [\n]. Similarly, a review of psychosocial adjustment of first year college students in the U.S. noted a significant decline in psychological, cognitive and affective well-being in first semester [\n]. The decline plateaued in second semester with the researchers noting that identification and intervention in first semester was paramount. It appears that the key time to measure and implement any intervention to enhance motivation to learn is within the first six months of first year.\nThe authors acknowledge the limitations of this study, including the small sample size of study participants from one cohort of physiotherapy students from a Western Australian university. Further, this study involved the use of a self-reporting instrument applied at one time point, to determine motivation to learn, based on a framework developed by A.J Martin, supported by contemporary models of motivation theory [\n]. A preliminary proxy longitudinal study determined the validity of this instrument for the population tested [\nThe literature points towards context and institution-specific research as being the key to understanding the complex construct of student motivation [\n]. The value of lessons learned from a local study to produce benefits through localised translation into practice, cannot be underestimated. Thus, this study reported on findings from investigating motivation to learn, specific to a physiotherapy program, considering the social context and interplay between a student’s motivation including their academic self-efficacy and the role of localised curriculum, specific to the learner. It is important to note that although the sample size for this study was not large, moderate effect sizes were shown in the correlation findings. Further research will review students’ change in motivation over time, as measured by the MES-UC, as well as relationships between academic motivation and performance throughout Years 2–4 of the program, including clinical performance. This may assist with planning the timing of any proposed intervention to enhance academic motivation during the degree program.\nIn a sample from one physiotherapy undergraduate program, there is a relationship between the admissions interview score on entry and motivation to learn, as measured by the MES-UC, applied at week three of the program. Self-belief, though not related to other admissions elements, was linked to academic performance in the transition into university, as measured by first year results. Motivation to learn and specifically self-belief with learning, may be influential in the transition into higher education. Consideration of individualised follow-up for students with lowered motivation levels on entry, may be appropriate. Motivation measures, such as the MES-UC, may be pertinent to determine student engagement with curriculum, ensuring that experiences in first year programs foster student self-efficacy with learning.\nNo funding was obtained for this study.\nAvailability of data and materials\nThe datasets that support the findings of this study are available from the corresponding author upon reasonable request.\nAustralian Tertiary Admission Rank\nMotivation and Engagement Scale – University/College\nAuthors’ contributions\nAll authors, SE, SEC, JC, AC, contributed towards methodology. SE was responsible for data collection and analysis. All authors contributed towards writing of the paper and read and approved the final manuscript.\nEthics approval and consent to participate\nEthical approval was gained for this study from The University of Notre Dame Australia Human Research Ethics Committee (reference number: 014168F). Students consented to participate through completion of a consent form and recorded their student number as an identifier. Consent to add admissions data to the study was sought retrospectively following initial data collection.\nConsent for publication\nThe authors declare they have no competing interests.\nSpringer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations.\nContributor Information\nSusan Edgar, Phone: + 61 8 9433 0115, Email: susan.edgar@nd.edu.au.\nSandra E. Carr, Email: sandra.carr@uwa.edu.au\nJoanne Connaughton, Email: joanne.connaughton@nd.edu.au.\nAntonio Celenza, Email: tony.celenza@uwa.edu.au.\nBradley D: Review of Australian higher education : final report. Canberra, A.C.T.: Dept of education employment and workplace relations; 2008.\nVossensteyn J, Kottmann A, Jongbloed B, Kaiser F, Cremonini L, Stensaker B, Hovdhaugen E, Wollscheid S.  Dropout and completion in higher education in Europe: main report. In. Centre for Higher Education Policy Studies: European Union. 2015.\nSeveriens S, ten Dam G. Leaving college: a gender comparison in male and female-dominated programs. Res High Educ. 2012;53(4):453–470.\nAbdulghani HM, Al-Drees AA, Khalil MS, Ahmad F, Ponnamperuma GG, Amin Z. What factors determine academic achievement in high achieving undergraduate medical students? A qualitative study. Medical Teacher. 2014;36(1):S43–S48. doi: 10.3109/0142159X.2014.886011.\nMartin AJ. School motivation of boys and girls: differences of degree, differences of kind, or both? Aust J Psychol. 2004;56(3):133–146.\nKusurkar RA, Croiset G, Mann KV, Custers E, ten Cate O. Have motivation theories guided the development and reform of medical education curricula? A review of the literature. Acad Med. 2012;87(6):735–743. doi: 10.1097/ACM.0b013e318253cc0e.\nPelaccia T, Viau R. Motivation in medical education. Medical Teacher. 2017;39(2):136–140. doi: 10.1080/0142159X.2016.1248924.\nCook DA, Artino AR., Jr Motivation to learn: an overview of contemporary theories. Med Educ. 2016;50(10):997–1014. doi: 10.1111/medu.13074.\nMartin AJ. Motivation and engagement across the academic life span: a developmental construct validity study of elementary school, high school, and university/college students. Educ Psychol Meas. 2009;69(5):794–824.\nRyan RM, Deci EL. Self-determination theory and the facilitation of intrinsic motivation, social development, and well-being. Am Psychol. 2000;55(1):68–78. doi: 10.1037//0003-066x.55.1.68.\nBandura A. Social cognitive theory: an agentic perspective. Annu Rev Psychol. 2001;52:1–26. doi: 10.1146/annurev.psych.52.1.1.\nAmes C. Classrooms - goals, structures, and student motivation. J Educ Psychol. 1992;84(3):261–271.\nWigfield A, Eccles JS. Expectancy-value theory of achievement motivation. Contemp Educ Psychol. 2000;25(1):68–81. doi: 10.1006/ceps.1999.1015.\nten Cate TJ, Kusurkar RA, Williams GC. How self-determination theory can assist our understanding of the teaching and learning processes in medical education. AMEE guide no. 59. Medical Teacher. 2011;33(12):961–973. doi: 10.3109/0142159X.2011.595435.\nWeiner B. An attributional theory of achievement-motivation and emotion. Psychol Rev. 1985;92(4):548–573.\nMartin AJ.  How to motivate your child for school and beyond. Sydney: Bantram; 2003.\nMartin AJ. Examining a multidimensional model of student motivation and engagement using a construct validation approach. Br J Educ Psychol. 2007;77:413–440. doi: 10.1348/000709906X118036.\nMartin AJ. The motivation and engagement scale. 12th ed. Sydney, Australia: Lifelong Achievement Group; 2012.\nhttps://www.lifelongachievement.com/the-motivation-and-engagement-scale-mes-i8/\nLiem GAD, Martin AJ. The motivation and engagement scale: theoretical framework, psychometric properties, and applied yields. Aust Psychol. 2012;47(1):3–13.\nPajares F. Self-efficacy beliefs in academic settings. Rev Educ Res. 1996;66(4):543–578.\nMartin AJ. Motivation and engagement in diverse performance settings: testing their generality across school, university/college, work, sport, music, and daily life. J Res Pers. 2008;42(6):1607–1612.\nElphinstone B, Tinker S. Use of the motivation and engagement Scale–University/college as a means of identifying student typologies. J Coll Stud Dev. 2017;58(3):457–462.\nCollie RJ, Holliman AJ, Martin AJ. Adaptability, engagement and academic achievement at university. Educ Psychol. 2017;37(5):632–647.\nWurf Gerald, Croft-Piggin Lindy. Predicting the academic achievement of first-year, pre-service teachers: the role of engagement, motivation, ATAR, and emotional intelligence. Asia-Pacific Journal of Teacher Education. 2014;43(1):75–91.\nConley CS, Kirsch AC, Dickson DA, Bryant FB. Negotiating the transition to college: developmental trajectories and gender differences in psychological functioning, cognitive-affective strategies, and social well-being. Emerging Adulthood. 2014;2(3):195–210.\nBradley H. Should I stay or should I go?’: Dilemmas and decisions among UK undergraduates. European Educational Research Journal. 2017;16(1):30–44.\nEdgar S. Identifying the influence of gender on motivation and engagement levels in student physiotherapists. Medical Teacher. 2015;37(4):348. doi: 10.3109/0142159X.2014.948829.\nDyrbye LN, Thomas MR, Shanafelt TD. Medical student distress: causes, consequences, and proposed solutions. Mayo Clin Proc. 2005;80(12):1613–1622. doi: 10.4065/80.12.1613.\nEdgar S, Mercer A, Hamer P. Admission interview scores are associated with clinical performance in an undergraduate physiotherapy course: an observational study. Physiotherapy. 2014;100(4):331–335. doi: 10.1016/j.physio.2014.03.002.\nHammond JA. Assessment of clinical components of physiotherapy undergraduate education: are there any issues with gender? Physiotherapy. 2009;95(4):266–272. doi: 10.1016/j.physio.2009.06.003.\nMartin AJ. The motivation and engagement workbook. 12th ed. Sydney, Australia: Lifelong Achievement Group; 2012.\nhttps://www.lifelongachievement.com/the-motivation-and-engagement-workbook-i9/\nMercer A, Puddey IB. Admission selection criteria as predictors of outcomes in an undergraduate medical course: a prospective study. Medical Teacher. 2011;33(12):997–1004. doi: 10.3109/0142159X.2011.577123.\nPekrun R, Goetz T, Titz W, Perry RP. Academic emotions in students' self-regulated learning and achievement: a program of qualitative and quantitative research. Educ Psychol. 2002;37(2):91–105.\nBong M, Clark RE. Comparison between self-concept and self-efficacy in academic motivation research. Educ Psychol. 1999;34(3):139–153.\nZajacova A, Lynch SM, Espenshade TJ. Self-efficacy, stress, and academic success in college. Res High Educ. 2005;46(6):677–706.\nBandura A, Schunk DH. Cultivating competence, self-efficacy, and intrinsic interest through proximal self-motivation. J Pers Soc Psychol. 1981;41(3):586–598.\nBandura A. Self-efficacy - toward a unifying theory of behavioural change. Psychol Rev. 1977;84(2):191–215. doi: 10.1037//0033-295x.84.2.191.\nTurner NK. Development of self-belief for employability in higher education: ability, efficacy and control in context. Teach High Educ. 2014;19(6):592–602.\nBaik C, Naylor R, Arkoudis S.  The first year experience in Australian universities: findings from two decades, 1994–2014. Melbourne: Melbourne Centre for the Study of Higher Education; 2015.\nArtino AR, Hemmer PA, Durning SJ. Using self-regulated learning theory to understand the beliefs, emotions, and behaviors of struggling medical students. Acad Med. 2011;86(10 Suppl, RIME: Proceedings of the Fiftieth Annual Conference November 6–November 9, 2011):S35–S38. doi: 10.1097/ACM.0b013e31822a603d.\nThis section collects any data citations, data availability statements, or supplementary materials included in this article.\nData Availability Statement\nThe datasets that support the findings of this study are available from the corresponding author upon reasonable request.",
  "authors": [],
  "journal": "BMC Medical Education",
  "date": "2019 Apr 18",
  "keywords": []
}